{
  "date" : 1335855600000,
  "title" : "Comments around Oracle v Google",
  "body" : "There's been a lot of chatter about the Oracle v Google case,\nsometimes putting words into my mouth. I can't go into much detail\nbecause it is an ongoing court case where I'm likely to be a\nwitness. But there are a few points I feel I should restate that\nhave been said before: \n\n<ul>\n  <li>My \"Google totally slimed Sun\" comment was a personal moral\n  opinion. Not my guess at a legal result, or a legal opinion at\n  all - I am not a lawyer and would never pretend to be.</li>\n\n  <li>I certainly think that the patent system is broken, but the\n  system is what it is. The original basic theory makes sense to\n  me, but what it's evolved into doesn't. At Sun we had a near\n  death experience after losing a case with IBM, after that we\n  realized we had to play the game, no matter how bogus.</li>\n\n  <li>The wide implications of Oracle winning the copyright case\n  are pretty disturbing. But that's a practical opinion. How it\n  will go in the legal system is anyone's guess. It extends far\n  beyond Oracle: developers everywhere use APIs defined by many\n  other entities. I hate to think of what an emerging \"copyright\n  troll\" industry might be.</li>\n\n  <li>A lot of what I've read gets really hyperbolic on the\n  possibilities of the industrial meltdown that Oracle could\n  conceivably cause. Despite my well-known opinions on Oracle, they\n  wouldn't do any of the nightmare scenarios that some have\n  imagined: such a meltdown would not be in their own self\n  interest. They have actually been unexpectedly good stewards of\n  Java (although less so of Solaris).</li>\n\n  <li>The issue has always been interoperability. It's one of the\n  major aspects that has made the Java community thrive. The\n  freedom of developers to expect their programs to work has always\n  been at tension with the freedom of platform providers to do\n  whatever they please. At Sun, we always sided with\n  developers.</li>\n\n  <li>The Java patents were used by Sun as a tool to enforce\n  interoperability: follow the spec, you can use them for free. A\n  good result for developers derived from a bogus patent\n  system.</li>\n</ul>\n",
  "images" : [ ]
}