{
  "date" : 1069315200000,
  "title" : "Hell on the road to Prague",
  "body" : "The segments of my trip on Monday and Tuesday of this week set a\nnew low in my corporate travel experience. This is the second time\nI've written up this little history: the first got eaten in a\ncurious email disaster. It's just as well since I wrote up the\nfirst after several very stiff drinks at Charles du Gaulle airport.\nI'm writing this up partly so I don't forget, and partly to explain\nwhy I never made it to Prague to speak at the TechDays conference\nand visit the NetBeans engineering team. I'd like to apologize to\nall of the folks in Prague who were expecting me to show up. I\ntried. But some cosmic force had other ideas...\n\n<p>It started off well enough. I landed in Paris on time. Eric Mahe\npicked me up and we headed off to the Bouyges Telecom event where I\ndid the required schmoozing and took part in a press panel session.\nLots of very cool java cell phone demos: they've deployed DoCoMo's\ni-mode system. I ended up getting a ride to the airport with\nTakeshi Natsuno, the fellow who's in charge of DoCoMo's i-mode\nstrategy, who also was the founder of i-mode within DoCoMo. We had\na great conversation on the way.</p>\n\n<p>I finally get to the checkin counter where I'm told that I need\na Visa. I found this hard to believe since I had been to Prague\npreviously, without the need for a visa. The agent is quite\ninsistent, as only a Parisian can be :-( So I leave the checkin\ncounter moderately annoyed, but sure that this is just a bit of\nconfusion. I phoned Rosenbluth, the travel agents, and they\nconfirmed the need for a visa. My stress level ticks up a couple of\nnotches: if they could figure this out now, why the hell didn't\nthey catch it when they put together the itinerary? It's a part of\ntheir job! I tried checking in again, lining up for a different\nagent, to see if I could slide past. No dice. This one tracked down\nthe documentation for me to read and weep: yes, Canadians do need\nVisas. The fine to the airline for letting a person without a visa\nonto the plane was 9000 euros. I'd have to pay a similar fine, plus\npay for the flight back. To make it worse, it contained the phrase\n\"visa's must be obtained in the country of residence\". The\nRosenbluth folks were pretty unhelpful. They advised me to call the\nVisa Network folks. They couldn't say much either. They had\nessentially no information on Czech visa requirements.</p>\n\n<p>All through this I was calling the folks in Prague (mostly\nShelly Haggarty) to let them know what was going on. It was now\n6:30pm. Too late to do anything. I was not going to make it for the\nkeynote speech I was supposed to give the next morning. I checked\nin to the nearest hotel, the airport Sheraton, which was right\nthere. I decided to try going to the Czech visa office the next\nmorning to plead for a visa. I asked our folks in Prague to write\nup a letter for me to take with me to explain that I was needed in\nPrague in short order. I called up Rosenbluth. I got them to book\nme on the 12:55 flight the next day. This would get me there in\ntime to give my keynote at the end of the day. Reggie Hutcherson\nrescheduled his talk to fill the gap that I would be missing\nfrom.</p>\n\n<p>I had a plan. I could sleep.</p>\n\n<p>Up at the crack of dawn. Check out. Head in to Paris on the\nexpress train. Easy: the hotel was on top of the train station. The\naddress I was given was on Boulevard Haussmann. I couldn't tell\nwhich end of the boulevard the address was on, so I left extra\nearly to spend some time searching. This was a good thing, since I\nguessed wrong. I ended up doing a 10 block mad dash from one end of\nblvd Haussmann to the other. But no worries: I got to the office\njust before it opened. Argh!! I discovered that the address I was\ngiven was for the Czech Embassy, and the visa office was in the\nConsulate. On the other side of down. Fuck. Mad dash on the Metro\n(what a wonderful system!) to rue Bonaparte. Mad dash a few blocks\nto where the person at the Embassy had marked the position of the\nConsulate. Fuck. Looking at the numbers on the buildings, it was\nclear that the X was totally in the wrong place. Mad dash another 6\nblocks and victory: there was the consulate. And it contained the\nVisa office! It was now 9:45, my plane was to leave at 12:55.</p>\n\n<p>Shit. The visa office is packed, mostly with Turkish laborers\ndoing the migrant labor thing. No one spoke English, and I spoke\nlittle French, but the folks in the office had no problem telling\nme that I had to fill out this very detailed 3 page form before I\ncould even talk to an agent. I did ask \"how long does this process\ntake?\" to which I got the answer \"5 working days\". For some reason,\nI didn't just give up and walk out. I plodded on. While I was\nfilling out this form-from-the-depths-of-hell, a lady from the\noffice came out and asked \"Vous etes Canadians?\" (are you Canadian)\nfollowed by some stuff that I had a hard time following, but I\nroughly translated as \"I've just been yelled at by three levels up\nthe bureaucratic chain-of-command to get you through here as fast\nas possible\". Instant rocket ride. They took the letter from our\nfolks in Prague that had been faxed to me in the hotel. I don't\nknow what was done by whoever in the Prague office: but it worked.\nThey were falling over themselves to get me my visa\ninstantaneously. Everyone else waiting in line was miffed.</p>\n\n<p>Ooops. A snag. They needed to have a photograph of me so that\nthey could make the papers required for me to get past the border\nguards. Another mad dash through the streets of Paris to a place\nthat took ID photos. There was a line! Groan. I get my photo. Mad\ndash back.</p>\n\n<p>A frenzy of typing, stamping, sticking and laminating ensues\n(who'd have thought that a Visa would be so physically complicated\nto put together?). I pay the 96 euro fee and dash out of there with\nmy brand new visa. It's 10:50. 65 minutes to get the Visa! It's\namazing what a motivated bureaucracy can do!</p>\n\n<p>Mad dash to the St Germain du Pres station, Metro to les Halles,\nonto the express train to Charles du Gaulle. I've made it! The\nexpress train is much faster than yesterday's taxi ride. I get to\nthe airport with time to spare. Up to the checkin counter. I pass\nthe \"do you have a visa?\" test. Success! Many bonus points for the\nfolks in Prague! I was so happy!</p>\n\n<p>Then the checkin agent frowns. Brows wrinkle. My reservation is\nin order, but the ticket is not. I'm told to go to the ticket sales\noffice to straighten thing out. It's about 11:45. Fuck! Piss! Shit!\nMad dash to the sales office. Long line. One agent. Trying to skip\nthe line gets me a stiff \"Guardez la Queue!\". I call Rosenbluth to\nsee if they can straighten out the ticket. They confirm that the\nticket is indeed messed up. If I understood right, yesterday's\nRosenbluth agent had correctly changed my reservation, and had\nchanged my ticket to the new flight and time, but had gotten the\ndate wrong on the ticket. For some reason, fixing this was complex.\n(It's also insane that the airline systems have such a weak link\nbetween tickets and reservations that they have to change the two\nindependently! These problems shouldn't be possible! But I won't go\nthere...). The Rosenbluth agent is madly typing to fix the ticket.\nI madly dash back to the checkin agent (I love cell phones! My\ninternational roaming charges are going to be enormous!). The\nRosenbluth agent says the change is complex. Wants to talk to the\ncheckin agent. Checkin agent refuses to talk to Rosenbluth agent.\nShe's very insistent on this point. She does some typing and utters\nthe fateful phrase \"I'm sorry monsieur, but your flight has\nclosed\".</p>\n\n<p>My stress level jumped way way over the top. It's a wonder my\nhead didn't explode and leave a bloody mess all over the building.\nI'm devastated. So damn close to success. Such a struggle to get\nthe visa. And then this. I stumble away and stand shaking. I still\nhave the cellphone in my hand. The Rosenbluth agent asks \"shall I\nbook you on the next flight to Prague?\". I can't answer. I hang up\nthe phone. Life is just too damned short for this shit. All I can\nthink of is that I'm supposed to be joining my wife for\nThanksgiving vacation in two days. I completely give up. After all\nthat, it's not in me to face another round with Air France and\nRosenbluth. And a lot of my time in Prague has been eaten up in\nthis bullshit. I decide that the only path to regaining my sanity\nis to start my vacation early.</p>\n\n<p>Being a complete glutton for punishment, I call up Rosenbluth to\nget me the new reservation and cancel the intermediate\nreservations. But, in truth, I'm really calling to give them\nanother opportunity to fuck me over again, which they are only to\nhappy to do! (but I don't know this yet). They get me an economy\nclass reservation on an Alitalia flight leaving in a few hours.\nStill shaking, but starting to breath again, I head over to the\nAlitalia desk. It's in a different building so I get a nice long\nwalk to cool myself off :-(</p>\n\n<p>Once more at a checkin desk. Once more the checkin agent frowns.\nOnce more, the checkin agent sends me off to the sales desk. There\nthey explain that the ticket is all wrong. Because of the way the\noriginal itinerary was done, this flight can't just be added to it:\nit has to be a new itinerary (somehow incomprehensibly linked to\nthe way an attempt was made to apply the payment for the Air France\nticket to the Alitalia ticket). The Rosenbluth agent had apparently\nset it up as a separate itinerary, but had done it wrong. The\nticked needed to be \"one-way\". As a one-way, it couldn't be economy\nclass. For some reason \"one-way economy\" is a non-existent concept.\nIt had to be business class. Other things were messed up, so rather\nthan calling Rosenbluth to have them fix it, I just paid for the\nflight with my credit card. It actually wasn't as expensive as I\nhad guessed. It will be on my expense report. I just couldn't face\nanother call to Rosenbluth.</p>\n\n<p>Rosenbluth-free ticket in hand, I finally checked in, got\nthrough security, headed for the Alitalia lounge (which I got a\npass to since I had just bought a full-fare business class\nticket!). I took serious advantage of the free drinks. Got on the\nplane. And had an uneventful flight and got safely to my hotel.</p>\n\n<p>I feel <i>much</i> better now.</p>\n\n",
  "images" : [ {
    "image" : "Image47-large.jpeg",
    "href" : null,
    "align" : "right",
    "width" : 768,
    "height" : 477
  } ]
}