{
  "date" : 1057820400000,
  "title" : "My Grandmother, the Zen Master",
  "body" : "It was my grandmother's 98th birthday on Tuesday. I realized a long\ntime ago that she was really a Zen Master, without knowing it. A\nfew weeks ago I was in an engineering discussion with someone and\nmade a comment that I don't remember, but they commented in reply\n\"How very Zen of you\". In truth, all I was doing was parroting my\ngrandmother. \n\n<p>My grandmother was born in Iceland and lived alone with her\nmother. When my grandmother was 14 (1918) her mother died and she\nsold everything (which wasn't much) bought a boat ticket to Canada\nand a few years later (having spent some time with relatives in\nDafoe Saskatchewan) found herself married to my grandfather and\nliving in Banff Alberta. They ran the first ski resort in the\nCanadian Rockies and brought in the first ski lift - this wasn't\nmuch by today's standards, literally a log cabin and a rope\ntow.</p>\n\n<p>Mountains, snow, skiing, ... they were her life. 25ish years ago\nthere was a party held in Banff by a bunch of old-timers to\ncelebrate my grandparents 50th wedding anniversary. The stories\nthey told were really hair-raising. I wish I had written them down.\nOne of her sons, my uncle Gordon, was on the Canadian Olympic ski\nteam. My parents met skiing. Needless to say, I'm the anti-jock of\nthe family. I didn't inherit any of their skill.</p>\n\n<p>Where does \"Zen\" fit in? I suppose I could have titled this\nentry \"All I Really Need to Know I Learned while Skiing with my\nGrandmother\". She didn't use many words. She wasn't really into\ndetailed explainations. Just short aphorisms. The interesting thing\nabout aphorisms is that the listener applies a lot of\ninterpretation and can re-apply them. There are three things she\nsaid to me over and over again that, while she was talking about\nskiing, can easily be applied to engineering and life in\ngeneral:</p>\n\n<blockquote>\n  <b>Balance</b>. I'd come roaring down the hill and she'd yell\n  \"Balance, James! Balance!\" \"Keep your weight centered\". This one\n  echoes through my head every day. \n\n  <p>Even if she hadn't seen me ski down the hill, I'd come up to\n  her and she'd often say \"<b>James, you're breathing too hard. You\n  must be doing something wrong</b>.\" If it didn't look effortless,\n  you hadn't learned it yet. My engineering reinterpretation of\n  this is essentially the old Blaise Pascal quote: \"I apologize for\n  the length of this letter, but I didn't have time to make it\n  shorter.\" Take the time.</p>\n\n  <p>The most inscrutable was \"<b>Follow your breathing!</b>\" When\n  you come skiing down a hill there's a rhythm to the turns. As\n  you're making a turn there's tension in your leg muscles. In\n  between turns, the tension releases. To do it right, you have to\n  coordinate your whole body's muscle tension. A big part of this\n  is your torso - and in particular the chest muscles involved in\n  breathing. When you take ski lessons they often tell you to\n  breath out when you're in a turn - this is so that your chest\n  muscles are tense when your leg muscles are tense. Many people\n  end up doing this by seeing when they need to turn, and arranging\n  to breath out then. My grandmother turned this around: she let\n  her body breath at it's own natural rhythm, and she just turned\n  whenever she exhaled. Listen for the natural rhythms of life and\n  follow them. Go with the flow. When engineering, don't just come\n  up with some cool technology and jam it in to the solution of\n  some problem. Think about the problem and its context first and\n  let it lead you. Inspiration is 99% Observation.</p>\n</blockquote>It was humbling being a 20ish stud wannabee skiing\nwith my 70ish grandmother and realizing that I would never be as\ngraceful and fluid as she was, even at that age. \n\n<p>Her name is Margaret Carolyn Morrison (born Kar&#243;l&#237;na\nMargr&#233;t Sveinsd&#243;ttir).</p>\n\n",
  "images" : [ {
    "image" : "Image32-large.jpeg",
    "href" : null,
    "align" : "right",
    "width" : 546,
    "height" : 768
  } ]
}