{
  "date" : 1285657200000,
  "title" : "JavaOne was fun...",
  "body" : "...in a twisted way. I didn't attend any of the sessions, I just\nwandered around in an <a href=\n\"http://www.cafepress.com/OrcOmit.464745320\">obnoxious t-shirt</a>.\nJavaOne attendees were friendly and chatty. OpenWorld attendees\nwere confused. Oracle employees behaved like there was an invisible\nforce field around me: they did their best to keep their distance.\nI didn't run into anyone else wearing one of the shirts, but I\ntalked to lots who said they had them but couldn't bring themselves\nto wear them. Apparently one exhibitor had a box of \"Just Free It\"\nshirts that they started to give away at their booth, until the\nthought police descended. Mostly I went to bars and receptions and\nhad chats with reporters. Lots of entertaining conversations. \n\n<p>Most of the folks I talked to who attended the keynotes were\nstruck by how little of substance was said by anyone. The LPOD's\n180&#186; turn on the topic of cloud's was pretty amusing. The\ngenerally wooden presentation style of most of the senior\nexecutives was also amusing. Several folks commented on the body\nlanguage of the audience. Mostly apathetic, but for Mark Hurd's\ntalk, it was pretty tense.</p>\n\n<p>At one point I was chatting with a crowd of folks from HP. Their\ngeneral consensus was \"Oracle's gain is our gain\" :-) He's famous\nfor over-the-top cost cutting. One person I know well worked in the\nHP HQ building, where Hurd's office was. Like most offices, they\nhad break rooms sprinkled around the buildings with coffee machines\nin them. He discontinued the coffee service, but he didn't just set\nthe coffee supply budget to zero: plumbers actually came out and\nremoved the coffee machines and the plumbing to them (which had to\nbe expensive). This caused all employees to have to hike over to\nthe cafeteria whenever they needed a cup of coffee. Huge loss in\nproductivity. Nutty. One of the formerly Sun, now Oracle, folks\nasked roughly \"Larry hired Hurd, saying that fudging his expense\nreport wasn't grounds for dismissal; does that mean that all Oracle\nemployees now have permission to fudge their expense reports?\".</p>\n\n<p>One of the more entertaining lines I heard was at a cocktail\nparty held by some 3rd party partners. \"We love the Oracle sales\nforce!\" (what?? surprised look on my face) \"They're so nasty, their\nprices are so high, and their tactics so obnoxious that all we have\nto do is be credible and treat the customer with respect - then the\ndeal is ours!\". Yow.</p>\n\n",
  "images" : [ {
    "image" : "Invasion_of_the_body_snatchers.jpg",
    "href" : "http://en.wikipedia.org/wiki/Pod_People_(Invasion_of_the_Body_Snatchers)",
    "align" : "right",
    "width" : 325,
    "height" : 250
  } ]
}