{
  "date" : 1059548400000,
  "title" : "Flying at Mach 1",
  "body" : "<i>I got dragged into a little flame-fest on a mailing list and got\na little out of hand... Here's a email from me:</i> \n<hr>\n\n<p>What a troll-ish set of remarks based on zero knowledge and\nspreading massive falsehoods. Normally I don't respond to such\ndrivel, but this time, if feels like I have to:</p>\n\n<blockquote>\n  <tt>From: XXX Subject: Re: YYY</tt> \n\n  <p><tt>No, as I understand it he is a C developer.</tt></p>\n</blockquote>It is true, I have been a C developer, and I still do\noccasionally. But I have also developed code in C++, Fortran,\nAlgol, SNOBOL, Mesa, Smalltalk, Pascal, Modula, Simula, Cobol,\nBasic, Focal, BLISS, PL/1, Pearl, several versions of Lisp, and\nassembler code for x86, Sparc, PowerPC, IBM 360/370, CDC 7000(CPU\nand PPU), PDP {8,10,11,VAX} and a bunch of stuff too obscure for me\nto remember at all. Of that lot I've probably written the most in C\n- at least 500K lines of C written by me, personally, over a couple\nof decades. For the last decade I've written almost zero C code and\nwrite almost exclusively in Java. \n\n<blockquote>\n  <tt>Apart from throwing T-shirts, he hasn't done any work with\n  Java lately.</tt>\n</blockquote>\n\n<p>One could start a Clintonian debate on the use of the word\n\"with\". Almost everything I write is in Java these days. I mostly\nwork on things other than the compiler or the JDK release.</p>\n\n<p>This is the piece that makes my blood boil:</p>\n\n<blockquote>\n  <tt>He designed Java so marginally capable developers could have\n  a job. Hence all the annoying little limitations that slow down\n  development but prevent errors (and features). He finds it too\n  limiting to use himself. I can't really blame him.</tt>\n</blockquote>\n\n<p>This is so damned false I don't know where to begin. I designed\nJava so I could write more code in less time and have it be way\nmore reliable. In the past I've wasted huge numbers of hours\nchasing down memory smashes and all the other time wasters that are\nso typical of what happens when writing C code. I wanted to spend\ntime writing code, not debugging. Life is too short for debugging.\nAll of those little \"limitations\" turn out to be things that make\ncoding faster and debugging vanish.</p>\n\n<p>For example, lots of newbie's coming in from the C world\ncomplain about exceptions and the fact that they have to put\nexception handling all over the place - they want to just write\ntheir code. But that's stupid: most C code never checks return\ncodes and so it tends to be very fragile. If you want to build\nsomething really robust, you need to pay attention to things that\ncan go wrong and most folks don't in the C world because it's just\nto damn hard.</p>\n\n<p>One of the design principles behind Java is that I don't care\nmuch about how long it takes to slap together something that kinda\nworks. The real measure is how long it takes to write something\nsolid. Lots have studies have been done on developer productivity,\nand Java beats C and C++ by a factor of 2.</p>\n\n<p>It's kinda like the evolution of the airplane. Once upon a time\nwhen folks scooted around in open cockpit biplanes they navigated\nby sticking their heads out over the side of the plane and looking\ndown. When covered cockpits with windows were first introduced\npilots didn't like them because there was no way to stick their\nhead out. But if they had won the argument, they'd never have been\nable to fly at Mach 1 or at 30,000 feet. Stick your head into a\nMach 1 airflow and see what the bloody stump looks like. I want to\nfly at Mach 1. I'll take the windows.</p>\n\n<blockquote>\n  <tt>On Sunday, July 27, 2003, at 02:55 PM, ZZZ wrote:</tt> \n\n  <p><tt>I've forgotten, is Gosling a Java developer? If he is, why\n  does he use a Mac? Masochism? \"A state of denial\"?</tt></p>\n</blockquote>\n\n<p>I use the MAC because it's a great platform. One of the nice\nthings about developing in Java on the Mac is that you get to\ndevelop on a lovely machine, but you don't cut yourself off from\ndeploying on other platforms. It's a fast and easy platform to\ndevelop on. Rock solid. I never reboot my machine... Really!\nOpening and closing the lid on a Powerbook actually works. The\nmachine is up and running instantly when you open it up. No\nviruses. Great UI. All the Java tools work here: NetBeans and JEdit\nare the ones I use most. I tend to think of OSX and Linux with QA\nand Taste.</p>\n\n",
  "images" : [ {
    "image" : "Image36-large.jpeg",
    "href" : null,
    "align" : "right",
    "width" : 768,
    "height" : 512
  } ]
}