{
  "date" : 1170403200000,
  "title" : "Five things you probably don't know about me",
  "body" : "I've now been tagged not <a href=\n\"http://weblogs.java.net/blog/timboudreau/archive/2007/01/tag_and_im_it.html\">once</a>,\nbut <a href=\"http://blogs.sun.com/richgreen/\">twice</a> in the game\nof blog-tag that's been going on. It's clearly time to get it over\nwith, so here are five things you probably don't know about me: \n\n<ol>\n  <li>When I was a kid my favorite place to play was my\n  grandfathers shop and \"boneyard\". The boneyard was a few acres\n  next to the shop where he parked all of his old (dead) farm\n  equipment. It's history stretched back to about 1910 and had\n  several slowly decaying (but grand) steam tractors. They were my\n  favorites. The shop had a full set of blacksmithing tools. Lots\n  of fun!</li>\n\n  <li>My first job was cleaning the sidewalks at a <a href=\n  \"http://maps.google.com/maps?f=q&amp;hl=en&amp;q=calgary,+canada&amp;ie=UTF8&amp;z=18&amp;ll=51.086539,-114.103548&amp;spn=0.002271,0.005826&amp;t=k&amp;om=1\">small\n  strip mall</a> in Calgary. My favorite shop there was the only\n  one who was never my custormer: a baker named Seebe Borge (I hope\n  I got his name right). I kept trying to convince him to pay me to\n  shovel the sidewalks, and he kept saying no, but he'd regularly\n  hand me half a loaf of bread, fresh out of the oven, covered in\n  obscene quantities of butter, sugar and cinammon. He'd eat the\n  other half. Perfect food when standing outside watching the snow\n  fall.</li>\n\n  <li>Before I discovered computers, I wanted to be a forest warden\n  for the National Parks Service.</li>\n\n  <li>My first experience with computing was building a machine to\n  play tic-tac-toe for a science fair. I built it out of old\n  telephone relays and television parts that I obtained by dumpster\n  diving (I could never afford new anything). The amusing bit was\n  that the TVs were all vacuum tube machines that didn't have\n  anything like a low voltage power supply usable by the relays. So\n  I ran the relays on 300V, which often got exciting :-)</li>\n\n  <li>My first computing job was writing software to process data\n  from the <a href=\n  \"http://aurora.phys.ucalgary.ca/isis2/index.html\">ISIS II\n  satellite</a>. The picture on the right is the machine I worked\n  on, a PDP-8/I with 8K of RAM (eventually 12K). The pairs of white\n  circles are DECtape drives that the OS swapped on (no disk!). To\n  the left is a pair of 9 track tape drives, and to the left of\n  them in the blue cabinet is the analog tape drive where we read\n  the raw satellite data from. The display used for photography was\n  on the right, just off the screen. It had a phenominal 2Kx2K\n  resolution - which was hard given that the framebuffer was 4K of\n  RAM from the main memory. It was 6 bits/pixel, 12 bits/word,\n  hence 8K pixels or 4 scan lines in the framebuffer. We could\n  stear the 2Kx4 pixels up and down on the screen, which had a\n  camera attached to it. It took quite a while to pass enough data\n  through to get a full frame.</li>\n</ol>So, who should I tag? I'll start with <a href=\n\"http://blogs.sun.com/brewin/\">Bob Brewin</a> and <a href=\n\"http://blogs.sun.com/tpm/\">Tim Marsland</a>, the co-software-CTOs\nat Sun, neither of which have been doing enough blogging. My boss,\n<a href=\n\"http://blogs.sun.com/prague/entry/czech_java_user_group_first\">Laurie\nTolson</a>, who still hasn't started blogging. I should tag a\ncouple more, but these will cause me enough trouble for now.\n",
  "images" : [ {
    "image" : "isis_web2.jpg",
    "href" : null,
    "align" : "right",
    "width" : 400,
    "height" : 264
  } ]
}