{
  "date" : 1194422400000,
  "title" : "Cell phones in Japan",
  "body" : "One of the things that's always interesting about visiting Japan is\nlooking at all of their cell phones. I've seen some great things\nhere on this visit. \n\n<p>One was a very cool phone that flips open on the long side,\nsomething like a Nintendo DS - and in a piece of cool mechanical\nengineering, it can flip open on the orthogonal edge, just like a\nconventional flip phone. It has a lovely hardware implementation of\n<a href=\"http://en.wikipedia.org/wiki/OpenGL_ES\">OpenGL/ES</a> and\ndoes truly impressive 3D graphics. Fluid frame rates, great\nmodeling and texturing, ... a great handheld game machine. The\ngames I played were great - and Java! Distributed multiplayer\ngaming - challenge your friend to a road race while you're both\ncommuting on the train - and on different trains.</p>\n\n<p>One of the games was a bowling game that you play roughly the\nsame way that you'd use a Nintendo WII: you hold the phone as\nthough it's a bowling ball, and you go through the motions of\nthrowing the ball. You use a button press to release the ball. When\nthis happens, it does the physics. But the phone doesn't have\naccelerometers to measure how you move the phone. They used one of\nthe most glorious hacks I've seen in years: images are captured by\nthe camera as you swing it in your hand, which are then analysed\nand correlated and motion vectors are computed from the interframe\ndeltas.</p>\n\n<p>The most impressive thing I've seen is the use of cell phones\nfor money. I see people all over Tokyo paying for everything from\ngroceries in minimarts to airplane tickets by holding their phones\nup to cash registers. This is done by having a proximity\nstored-value smart-card chip embedded in the skin of the phone.\nThese cryptographically secure chips can do transactions with\npoint-of-sale terminals instantaneously, no matter how slow the\nnetwork is, or even if it is down. It is very much like the\nstored-value smart-cards that have been used around the world for\nyears. But having them embedded in the skin of a cell phone has\nsome great advantages, stemming from the Java APIs that allow\ndirect communication between the stored-value chip and the phone.\nThis allows a variety of banking and commerce applications to be\nbuilt. For example, to put more money into the stored-value chip,\nyou don't have to go to a bank kiosk, you can do it directly over\nthe network from the phone. You can also do Quicken-style\ncheck-writing and budgeting - directly from the phone. All Java\napps. As a bonus, if you lose your phone (or it gets stolen) you\ncan call up the phone company and (after a few security questions)\nthey can lock the phone remotely and use the network's\nlocation-awareness capabilities to tell you roughly where the phone\nis. (Privacy freaks: explode now...).</p>\n\n<p>Plus... You can use your cell phone to book airplane (and train)\ntickets, and use the cell phone itself as both the ticket\n<b>and</b> the boarding pass. Zero paper. To check in, you just\nswipe your phone on a reader as you're dashing to your seat. Very\nfast and secure.</p>\n\n<p><b>[Update</b> <i>in response to <a href=\n\"http://human-begin.blogspot.com/\">flavin</a>'s comment about the\ndesign of JavaME:</i> In fact, the situation is quite the opposite:\nthe evolution of JavaME is heavily driven by the capabilities of\ninternational carriers and phone manufacturers. It's a huge\nfrustration to American JavaME developers that they can read about\nall of these cool APIs (like OpenGL/ES), but the available systems\ndon't support them<b>]</b></p>\n\n",
  "images" : [ ]
}