{
  "date" : 1298016000000,
  "title" : "Refactoring considered harmful, sometimes",
  "body" : "<a href=\n\"http://en.wikipedia.org/wiki/Code_refactoring\">Refactoring</a>\ncovers a broad swath of techniques to make code cleaner, more\nreliable, more maintainable, ... But sometimes, these attributes\nfight against each other. The usual attribute that causes trouble\nis \"more performance\". For example, consider factoring out a\nloop-invarient boolean: \n<pre>\nfor(....) {\n    ...\n    if(b) A;\n    else B;\n    ....\n}\n</pre>\nwhen b is loop-invarient, this can become: \n<pre>\nif(b)\n    for(...) {\n        ...\n        A;\n        ...\n    } else\n    for(...) {\n        ...\n        B;\n        ...\n    }\n</pre>\nDepending on a wide variety of factors, this can be faster.\nAlthough it might be slower. Careful benchmarking is required :-) \n\n<p>It is certainly less maintainable and less clear. When you see a\npice of code that is the result of such a transformation, it's\noften difficult to tell that the two loops are related. If a bug is\nfound in any of the replicated pieces of code, it has to be fixed\nin *both* places. Testing gets more complicated because the\nreplicated code paths have to be independently (and somewhat\nredundantly) tested. To compound the problem, if you have (for\nexample) multiple loop-invarient booleans, the code expansion is\nexponential (!!) in the number of factored-out booleans. This can\nget pretty insane pretty fast. I've seen instances where folks have\ntried to be clean about these transformations by clever use of C\nmacros, but this can get really messy. And the code explosion can\nbe dramatic: I got pulled into this problem years ago when someone\nchecked a new line-drawing routine into the SunOS kernel (that's\nwhat Solaris was called before the SVr4 merge) that was bigger than\nthe whole rest of the kernel. But it was fast. I got the job of\nfixing it :-(</p>\n\n<p>For most people, this class of transformations should be avoided\nlike the plague they are. But for folks like me who all too often\nneed to do intense tuning, they are necessary. Can they be made\ncleaner? It's a pity that refactoring is viewed purely as something\ndone in an IDE. Sometimes, you can do cool things if the\nrefactoring is expressed in the language. But that's another blog\nentry.</p>\n<hr>\n\n<table>\n  <tr>\n    <td valign=\"top\">PS.</td>\n\n    <td>It's \"build season\" for the <a href=\n    \"http://www.usfirst.org/roboticsprograms/frc/default.aspx?id=966\">FIRST\n    Robotics Competition</a>. A couple of years ago Sun worked with\n    FIRST to put a <a href=\n    \"http://first.wpi.edu/FRC/frcjava.html\">JavaVM on the\n    industrial automation controller that they use</a>. Before\n    this, programming the robots was almost impossible. The contest\n    turned into all-mechanical projects, with very little software.\n    With the JVM (and the ability to debug running robots) they've\n    become much easier to program. This year I'm mentoring the team\n    at my younger daughter's school. I'm having a great time\n    helping these kids write control software that works with a\n    pile of motors and sensors. Can't wait to see it all work.</td>\n  </tr>\n\n  <tr>\n    <td valign=\"top\">PPS.</td>\n\n    <td>The RSA conference is in town, which was fun to wander\n    through. It's hard to believe that so many companies making\n    firewalls can succeed. The hard part for me is that I've become\n    something of a magnet for former sun customers and partners to\n    tell their tales of the <a href=\n    \"http://www.merriam-webster.com/dictionary/shenanigans\">shenanigans</a>\n    that the Oracle sales force engages in to trap customers. One\n    got caught in a weird shell game where the oracle team was\n    working hard chasing him around town to prevent him from\n    talking to another vendor - physically interposing themselves\n    between the vendor and the customer. As frustrating and\n    pathetic as the stories are, I find them easy to manage by\n    treating them as humor. It is outrageously goofy the stunts\n    that get pulled (although the 5x to 20x price increases often\n    forced on customers are infuriating - talk to anyone\n    \"upgrading\" from Sun Identity Manager).</td>\n  </tr>\n</table>\n",
  "images" : [ ]
}