{
  "date" : 1063436400000,
  "title" : "The first rule of debugging",
  "body" : "<b>If the bug isn't where you're looking, you're probably looking\nin the wrong place</b> Seems pretty obvious, but I get nailed by it\nall the time: I get some preconcieved notion of where the problem\nis, and then I focus there to the exclusion of looking at other\npossibilities.\n\n<p>Readers of this blog may be wondering why It's been so long\nsince I last added an entry. I write this blog using my own tool,\nwhich you can find at bloged.dev.java.net. It recently developed a\nproblem that took me a long time to resolve - and it was a classic\ncase of looking in the wrong place. Of course, the real reason that\nit took a long time to resolve is that I tried to write a blog\nentry with the new version, but that failed; then I couldn't look\nat the problem right away because there was other stuff I had to\nrush off to. It's a real problem when you have to debug things in\n15 minute sessions, once a week.</p>\n\n<p>Atsuhiko Yamanaka had been doing some excellent work adding\nsecurity features to the ssh web site access facilities. He did a\nputback, I brought it over, rebuilt... <b>boom</b> it didn't work.\nAnd it didn't work in a perplexingly silent way. I was pretty\nsurprised since Atsuhiko has done flawless work and I totally\nexpected his stuff to fly. But this didn't - the problem was\n<i>clearly</i> in the code he had put back so that's where I was\nlooking. But look as I might, I couldn't find the problem. I'll\nspare you the intervening gory details about the stupidly fruitless\nsearch for a problem in his perfect code. In the end it turned out\nto be totally elsewhere: I had leapt from the bringover/build/boom\ncorrellation to believing I knew where the bug was. But there were\nother things going on in the world. In this case, it was a\nconfiguration change in another part of the universe. I only found\nout about it when I <tt>ssh</tt>ed to the server, and that failed\ntoo..... A few minutes later, problem solved.  <i>Duh</i></p>\n\n",
  "images" : [ ]
}