{
  "date" : 1118991600000,
  "title" : "Brazialian National Healthcare",
  "body" : "Late last year I went on a trip to Brazil to talk at a Java\nconference. While I was there I got taken on a customer visit to\nsee the new software infrastructure for the Brazialian National\nHealthcare sytem. I keep getting asked about it, so I thought it\nwould be good to post a note here, even though the visit happened\nmonths ago. The system hasn't been fully deployed yet, they've just\ndone a test deployment, but they're very happy with it. Their test\ndeployment was 12 million (12,000,000!) people in 44 cities. \n\n<p>It's the \"operating system\" for Brazilian National Healthcare.\nIt's huge bags of J2EE and J2SE code. In the center, they have some\nserious servers (E10Ks &amp;c) with large amounts of storage. This\nis actually physically in 5 sites with serious security. These are\nfed through a hierarchy of regional servers from hospitals, clinics\nand pharmacies.</p>\n\n<p>Every interaction between a health care professional and a\npatient is recorded in the system. Every patient has a national\nmedical system card. Every scrap of data is in the database.\nX-rays. EKGs. Video recordings from endoscopic exams. Some of these\nare entered/scanned manually, but many are streamed directly from\nthe instruments. You can even remotely examine data as it is being\nstreamed into the database, giving you live access to the\ninstruments in an in-progress encounter. The person who was showing\nthe system to me was a cardiac surgeon. As she was giving me the\nwalkthrough on all of this, she hopped (in the cyberspace sense)\ninto an in-progress heart transplant and took me on a tour through\nall the instruments. I also got the required video tour through a\nrectal exam, which seemed to be standard surgeon humor :-)</p>\n\n<p>These folks use every Java API you can imagine. They're\ncritically dependent on many of the ones that we (in a corporate\nsense) frequently denigrate like Advanced Imaging and Media. After\nall, what good is it to record video if you can't view it?</p>\n\n<p>This system has already paid for itself several times over, just\nin cutting out drug fraud: when you go to a doctor they can see\nevery other doctors visit you've been in for, every test result,\nand every prescription. This helps them enormously in getting a\nclear picture of what has been going on with a patient. For\nexample, if a patient just got a prescription for Prozac from one\ndoctor yesterday, they can't get a new one from another doctor\ntoday. Then when they go into the Pharmacy, they don't hand the\ndruggist a scrap of paper, they had them their medical ID card, and\nthe doctor gets the prescription out of the database, and marks it\nin the database as having been filled.</p>\n\n<p>They even have specialized terminals for clinics in the Amazon\njungle. This led to a discussion of one of their more amusing\nproblems: they don't know the names of many of their patients\nbecause in many indigenous religions, disclosing your name is the\nsame as handing over your soul. (I feel that way myself a lot of\nthe time). So they teach the indians that the medical ID card is\nroughly a magic talisman that helps the people in the clinic do\ntheir medicine. The medical system doesn't need to know the\nidentity of its patients, it merely has to correlate people to\nmedical records.</p>\n\n<p>Right now, the ID card is a traditional magstripe card, but\nJavaCards have recently gotten cheap enough for them to consider.\nThe current deployments don't use much J2ME, but they likely will\nsoon. This is motivated by the fact that J2ME cell phones &amp;\nwireless PDAs now work in all sorts of obscure areas, and will\nallow them to get rid of their current generation of rather clumsy\nnon-desktop terminals.</p>\n\n<p>I wish the medical system I use here in the Bay Area was this\ncoordinated.</p>\n\n<p>Don't miss <a href=\n\"http://servlet.java.sun.com/javaone/sf2003/conf/sessions/display-2680.en.jsp\"\n shape=\"rect\">their talk at JavaOne</a></p>\n\n",
  "images" : [ ]
}