{
  "date" : 1118991600000,
  "title" : "Whack-a-Mole",
  "body" : "All of Sun Labs went to the Santa Cruz Beach Boardwalk today to\nride rollercoasters, play arcade games, and generally have a good\ntime. It reminded me of one of my favorite metaphors for the\nprocess of design: it's a game that appears often in these game\narcades in different forms and with different names. The one at the\nBoardwalk is called Whack-a-Mole. There's a square box with a grid\nof large holes on the top. Usually three holes by three holes.\nThere's a mechanism to cause something (in this case, a fake fur\nMole) to pop out of one of the holes. You play the game by taking a\nbat and trying to whack (hit) the mole on the head. But the mole\nalways pops back down into his hole and pops up somewhere else. So\nyou take the bat and try to whack the mole on the head in it's new\nplace. But of course, he pops back into the box and pops up\nsomewhere else. No matter what you do, the mole always pops up\nsomewhere else. You win if you can get the mole to stay in the box\nand not pop up. Damn near impossible.\n\n<p>Design is like that. Designs always have problems. So you go\nwork on that problem. But often what you do to solve that problem\ncauses new problems to pop up somewhere else. All too often people\nwill come to me and say \"I've solved the problem\". I'll look at it\nand essentially say \"yes, but no: what you've really done is\n<i>moved</i> the problem. Design is about compromise. You rarely\nget to eliminate all problems: you just get to decide which\nproblems you're willing to work with.</p>\n\n<p>One place where this shows up as a real point of friction is\nwith folks fresh out of school. Throughout shool you mostly work on\nproblems concocted by instructors for some didactic purpose. They\nhave a solution in mind. You know that the solution exists. The\nproblem is usually constructed so that the solution is clean (this\nmost often shows up in high shool mathematics). But the real world\nisn't that way. Problems are messy. There often isn't a perfect\nsolution that solves all the problems. Major frustration and\ndisillusion ensues.</p>\n\n<p>Get over it.  <i>Seek Balance</i></p>\n\n",
  "images" : [ ]
}