{
  "date" : 1157958000000,
  "title" : "The Black Hole Theory of Design",
  "body" : "The past few weeks have been pretty entertaining: there's the final\ncrunch to getting JDK6 out the door (with the side-thrill of\ncoordinating with the tea-leaf-reading exercise that is Windows\nVista), bringing closure to the open source debate, and the most\nfun: figuring out the plan for JDK7. This last is the geek version\nof writing up a Christmas Present wish list. \n\n<p>The list is mostly being put together by <a href=\n\"http://blogs.sun.com/dannycoward\">Danny Coward</a> and <a href=\n\"http://blogs.sun.com/mr\">Mark Reinhold</a>, with a lot of\nkibbitzing from a cast of thousands. We do surveys of partners,\nfold in statistics from the <a href=\n\"http://bugs.sun.com/bugdatabase/index.jsp\">bug voting system</a>,\nstir up with our own opinions and then run the JCP debate.</p>\n\n<p>There's an entertaining little firestorm going on over <a href=\n\"http://en.wikipedia.org/wiki/Closure_%28computer_science%29\">closures</a>.\n<a href=\"http://gafter.blogspot.com\">Neal Gafter</a>, <a href=\n\"http://blogs.sun.com/gbracha\">Gilad Bracha</a>, <a href=\n\"http://blogs.sun.com/ahe\">Peter Ah&#233;</a> and many more are\nfighting it out. The really heated debate is all in email and I'm\nincredibly far behind in reading it (by several hundred\nmessages).</p>\n\n<p>I have somewhat mixed feelings about closures: they are pretty\ncomplicated. But they're an instance of what I think of as the\n<b>Black Hole Theory of Design</b>. I have a really strong memory\nfrom years ago of Guy Steele saying roughly \"<i>Lisp is a Black\nHole: if you try to design something that's not Lisp, but like\nLisp, you'll find that the gravitational forces on the design will\nsuck it into the Black Hole, and it will become Lisp</i>\". [Guy\ndoesn't actually remember making this remark, but he does say it\nsounds like the kind of flip comment he would make; I could also be\ntotally mis-remembering who said it, but I haven't found any quote\nlike it through Google].</p>\n\n<p>Closures feel to me like one of these design Black Holes. When\ninner classes were designed, we wanted to avoid the complexity of\nclosures. But this brought about oddness and tension of it's own\nthat has left me less than happy with inner classes. So, should we\njust give in to the force of gravity and go the rest of the way?\nThe debate's afoot. It's going to be an entertaining year.</p>\n\n",
  "images" : [ ]
}