{
  "date" : 1281250800000,
  "title" : "Cynical chuckles",
  "body" : "Another conversation thread floating around the internet these days\nis speculation about <a href=\n\"http://jcp.org/aboutJava/communityprocess/summaries/2007/December07-summary.html\">Oracle\nand the future of the JCP</a>. Specifically about this little\nnugget from December of 2007: \n\n<blockquote>\n  <p><em><strong>Resolution 1 (proposed by Oracle, seconded by\n  BEA)</strong></em></p>\n\n  <blockquote>\n    <p>\"It is the sense of the Executive Committee that the JCP\n    become an open independent vendor-neutral Standards\n    Organization where all members participate on a level playing\n    field with the following characteristics:</p>\n\n    <ul>\n      <li>members fund development and management expenses</li>\n\n      <li>a legal entity with by-laws, governing body, membership,\n      etc.</li>\n\n      <li>a new, simplified IPR Policy that permits the broadest\n      number of implementations</li>\n\n      <li>stringent compatibility requirements</li>\n\n      <li>dedicated to promoting the Java programming model<br>\n\n      </li>\n    </ul>\n\n    <p>Furthermore, the EC shall put a plan in place to make such\n    transition as soon as practical with minimal disruption to the\n    Java Community.\"</p>\n  </blockquote>\n</blockquote>I actually got an email recently that started \"When\nOracle starts the Java foundation...\". Ethics and consistency\naren't exactly the <b title=\"Larry, Prince Of Darkness\">LPOD</b>'s\nreputation: he's famously a fan of a quote attributed to Genghis\nKhan: \"It's not enough that we win; all others must lose\". This\nresolution in 2007 was all part of a control game played by Oracle,\nno high-minded principles involved at all. Now that they have a\ndifferent point of view, it's clear that this resolution being\nhonored is about as likely as pigs growing wings. \n\n<p>But Java is likely to be in pretty safe shape. It's a key piece\nof technology in too many of Oracle's businesses, so screwing Java\nup too badly would hurt them more than almost anyone else. Well....\nMostly. Oracle's universe is defined by the enterprise datacenter.\nStuff outside of the datacenter makes as much sense to the core of\nOracle as bicycles make sense to fish. But when they got Sun and\nJava, they got a lot of stuff outside of the datacenter. It <a\nhref=\"http://en.wikipedia.org/wiki/Does_not_compute\">does not\ncompute</a>.</p>\n\n<p>It's Solaris I'm really fearful for: I wish the <a href=\n\"http://www.illumos.org/\">Illumos</a> folks well, but the data on\nSolaris so far is pretty discouraging. If only because the rate at\nwhich key technologists from Sun have been fleeing Oracle's culture\nof fear has been so high that there's almost no one left.</p>\n\n<p>[ <tt>String LPOD=\"Larry, Prince Of Darkness\";</tt> don't know\nwhere I first heard this, but it fits ]</p>\n\n",
  "images" : [ {
    "image" : "PigWithWings.png",
    "href" : null,
    "align" : "right",
    "width" : 121,
    "height" : 118
  } ]
}