{
  "date" : 1186470000000,
  "title" : "It's been too long...",
  "body" : "...since my last blog entry. 2 months! What have I been doing?\nWell... Mostly not stuff that's really blogable. I took a long\nvacation because my wife started a new job, and she wanted to go\nhave some fun before starting. At work, life has been a good form\nof madness: working on the JavaFX plan, helping to make sure that\nall the pieces fit together and that everyone is building the right\nthing. The tragedy of my life these days is that it doesn't really\nwork for me to do any coding for a real piece of the system: I'm\nalways getting dragged into some diversion or other, which messes\nup my ability to deliver code. So I write irrelevant stuff on the\nside, mostly doing little coding experiments. \n\n<p>This week is <i>fun</i>. I'm at <a href=\n\"http://www.siggraph.org/s2007/\">Siggraph</a>. It's the one\nconference I year that I go to to listen and learn (I've been\nattending pretty regularly for about 25 years - what a horrible\nthought!). I don't know what it is, but this is turning out to be\none of the best Siggraph's in years. Glenn Entis, the CTO of\nElectronic Arts, did the keynote. My favorite line from it was\nroughly \"The Tool is the Game\": lots of games these days (like The\nSims) have two major modes: gameplay and a\nsenario/space/prop/avatar/... design tool. They've been finding\nthat folks spend very large amounts of time in the tool - outside\nof the game. Players get a huge amount of pleasure out of building\nthe world. Gameplay is sometimes almost at afterthought. Creativity\nis fun!</p>\n\n<p>One of my favorite parts of Siggraph is the Emerging\nTechnologies area. It's filled with stuff that is usually research\nprototypes. Some of them are pretty far along. One kind of\ntechnology that has shown up over and over again through the years\nis electronic paper. It's generally \"cool idea, lots of work to\ndo\". But this year, the folks from <a href=\n\"http://www.eink.com/\">e.ink</a> showed the most advanced stuff\nI've ever seen. They're getting really close. The screens are\nbecoming gorgeous. Beautifully readable text in bright\nsunlight.</p>\n\n<p>As for papers, my favorite yesterday was the whole session on\nnon-photorealistic rendering. Every paper was interesting. Geeks\nand artists in the same room. Wonderful!</p>\n\n",
  "images" : [ ]
}