{
  "date" : 1319266800000,
  "title" : "Steve Jobs on Hewlett Packard",
  "body" : "The bits and pieces of Steve Jobs's upcoming biography that have\nbeen coming out have been fascinating. One particular one that\nreally rips me up is his <a href=\n\"http://news.cnet.com/8301-13924_3-20123830-64/steve-jobs-leaves-apt-rebuke-of-hewlett-packard/\">rebuke\nof the board of directors of Hewlett Packard, and in particular,\ntheir leadership choices</a>. I absolutely agree with Jobs. It's\nhard to describe the board's CEO choices as anything but completely\ninsane. They've gone from one really awful choice to another.\nHiring a CEO is a tricky thing, it often goes awry under the best\nof circumstances. But they seem to be acting so stupidly that they\nmust be actively trying to tank the company. My wife worked for HP\nunder Mark Hurd in the headquarters complex: the place got totally\nground up. Apotheker did not understand any of HP's strengths and\ntried to turn it into something he was familiar with: a weak shadow\nof Oracle and IBM, which it had almost no basis to build from. What\nwill Meg Whitman do? Try to turn it into an auction house? The\nboard should fire themselves and put in place someone who knows how\nto build and run a systems company. There aren't many around, but\nthey exist. The board needs to think in terms of investing in\nbuilding HP up to being a strong and vibrant company. Not stripping\nit down into something that can be milked of its last pennies. \n\n<p>Who would I pick? I'm not completely sure, but the top of my\nlist is not too surprising: Scott McNealy. Wall Street and the\nanalysts hate him, having unfairly pilloried him for years. I've\ngot my own set of issues with him, but he could drive HP to being\nincredible again. It's a world he understands better that anyone\nelse on the planet. HP used to be Sun's opponent, but I doubt that\nthis would be a problem for Scott: he's hugely into team sports and\nknows that whatever the color of the shirt you wear during the\ngame, you play to win.</p>\n\n",
  "images" : [ ]
}