{
  "date" : 1316242800000,
  "title" : "Some theorizing",
  "body" : "Some of my pilot friends have been doing some theorizing based on a\ncouple of photos: \n\n<p>This shows the plane inverted (which it shouldn't be) the left\nelevator trim tab is clearly gone. This would mess up control of\nthe plane.</p>\n\n<p>In the words of Jim Mitchell: \"In the one going straight down\nyou can see no part of Jimmy Leeward's helmet in the cockpit. This\nlends credence to it being the trim tab failure/departure that\ncaused the pull up and over and that he was pushed down so hard by\nthe G forces that he could not control the aircraft.\"</p>\n\n<p>In the words of Rob Gingell: \"Was thinking more about that 2nd\npicture, and regardless of my curiosity about its provenance, I\nthink Jim's comment about lots of G's pushing Leeward down makes\nsense. Given that they're pulling 3-5 G's making the turns anyway,\nif something suddenly increased the G loading chances are the\npilot's going to black out. He may have been unconscious from that\npoint on or even if not, sufficiently disoriented to not be able to\nexert any control over the plane.\"</p>\n\n<p><b>Update:</b> Another comment from Jim Mitchell: \"I have also\nnoted one other thing on the picture of the GG upside down. Look at\nthe cockpit and you will see Leeward's white helmet at the very\nfront right up against the instrument panel. I think that's why you\nsee nothing in the vertical picture. Look at the picture of GG\ntaxiing and you can see the same helmet and Leeward's head is\neasily visible under the canopy.</p>\n\n<p>\"Finally, the NTSB say they have found the trim tab near where\nthe pullup began, so I suspect he felt vibration from it,\nstraightened out and began to pull up when it came off, which\nresulted in the GG pulling up at high G's. After that I don't think\nhe played any part in the aircraft's flight path.\"</p>\n\n",
  "images" : [ {
    "image" : "5e7548b1ec89fb14f80e6a70670062b6.jpg",
    "href" : null,
    "align" : "center",
    "width" : 3600,
    "height" : 2964
  }, {
    "image" : "23c6ee56ec89fb14f80e6a706700459c.jpg",
    "href" : null,
    "align" : null,
    "width" : 1681,
    "height" : 2218
  } ]
}