{
  "date" : 1210143600000,
  "title" : "What a day...",
  "body" : "First things first, a couple of things to check out: \n\n<ul>\n  <li>Track down the real-time demo in the pavilion (the one with\n  all the colored balls shooting around) and see if you've run the\n  lottery :-) The prize is dinner with me and Greg Bollella on\n  Thursday.</li>\n\n  <li>The Gemalto folks are running a coding contest: you write a\n  control algorithm for a tank that drives around a field filled\n  with other tanks. Whoever dies last wins. The interesting catch\n  is that the code you write has to run on a smart card...</li>\n</ul>What a rush yesterday was. I had promised myself that I'd blog\na couple of times during the day, but there was no way that was\ngoing to work... \n\n<p>The day started off with a bang shooting t-shirts into the\naudience with John Gage and Chris Melissinos. It's remarkable how\ngood a job the big 3-person slingshot does. Totally low tech, but\nvery physical and theatrical. We did a cooperative opening of the\nshow. I mostly talked about how the show was instrumented using\nmotes from <a href=\"http://www.sentilla.com/javaone\">Sentilla</a>.\nIf you have a \"maker\" itch to scratch, they're selling cool\ndeveloper kit.</p>\n\n<p>If you're looking for another cool toy to spend money on, check\nout the LiveScribe pen. When I first heard about it (a JVM in a\npen? WTF?) it seemed like an odd thing to do, but when you go\nthrough some of their usage scenarios, it's totally brilliant.</p>\n\n<p>My keynote isn't until Friday, so I got to just sit and watch\nRich Green's keynote. Lots of nice demos, but the sphere of\ninteractive media streams had me in awe. Between the efforts of the\nJavaFX, graphics and Hotspot teams, it got amazing performance.\nHaving the keynote end with <a href=\n\"http://java.sun.com/javaone/sf/media_shell.jsp?id=FRdamp267542\">Neil\nYoung being a geek</a> for 15 minutes was pretty damned cool. He's\na fan of blu-ray and is in the midst of a big project using it.</p>\n\n<p>The bulk of the day was press interviews, videotaping and time\nwith customers. They'd describe problems they're having and I'd get\nthis surreal deja vu feeling \"But we fixed that in JDKn\"... \"*sob*\nwe're stuck in JDKm(&lt;n)\" *sigh*</p>\n\n<p>The work day ended up with the <a href=\n\"http://blogs.sun.com/duke/\">Dukes Choice</a> award ceremony. Once\nagain, it was really hard to choose the winners. There is so much\ngreat stuff being done by the community. If you come to my keynote\non Friday, several of them will be doing demos.</p>\n\n<p>The day was closed with a traditional pub crawl...</p>\n\n<p>The design for this years t-shirt came out rather well:<br>\n<br>\n(with apologies to <a href=\n\"http://www.artic.edu/artaccess/AA_Modern/pages/MOD_7.shtml\">Edward\nHopper</a>.)</p>\n\n",
  "images" : [ {
    "image" : "TShirt2008small.jpg",
    "href" : null,
    "align" : null,
    "width" : 784,
    "height" : 386
  } ]
}