{
  "date" : 1162281600000,
  "title" : "RIP: Pink Flamingo, 1957-2006",
  "body" : "An old friend sent me a note to point out the <a href=\n\"http://www.sun-sentinel.com/features/lifestyle/sfl-hg20flamingooct20,0,4474139.story?coll=sfla-features-headlines\">passing\nof the company that made the original pink plastic lawn\nflamingo</a>. She figured I wanted to know since pink flamingos\nwere involved in my first mention in a newspaper article. The story\ngoes like this: \n\n<p>I was working at a place called the Information Technology\nCenter at Carnegie-Mellon University, funded by IBM. A new building\nwas being built for the center. We moved in before the building was\ncompleted. It was quite a piece of modern architecture. A building\nthat architects get awards for. Sleek and unrelentingly black.\nSurfaces that only Steve Jobs and Darth Vader could love. It had a\nterraced pyramid-ish shape. This was 1984.</p>\n\n<p>Shortly after moving in, several of us were in a bar down the\nstreet, downing beers and bitching about the blackness of the\nbuilding we now worked in. Someone at the table said something like\n\"it needs a bit of color - like a pink flamingo\". I'm not smart\nenough to come up with that idea, but I am dumb enough to implement\nit. I went to a local gardening store and bought a couple of\nflamingos, mounted them on a little wooden platform and placed them\non the little rooflet-thing outside my office window. It was a\nthing of beauty. The flamingos were small, but intensely pink. From\nmany blocks away, they were clearly visible. Tiny pink dots in this\nimmense blackness. Sitting in my office I could watch people\nstopping on roads and sidewalks and staring, trying to figure out\nwhat the bright pink beacons were.</p>\n\n<p>Many forms of hell broke loose. One of my favorite happened one\nday when I was sitting in my office hacking away with my door open.\nThe building was finally completed and representatives of the\nuniversity, the contractor and the architect were doing a\nwalk-through to hand-off the building from the construction company\nto the university. They happened to walk down the hall by my\noffice. Through my open door, past me, and out the window, the\nflamingos were <i>clearly</i> visible. The architect really lost\nit. He hated the flamingos. He started yelling at the contractor\nwho (roughly) deadpanned \"We didn't put it there. It's outside the\nscope of the contract. It's not our responsibility\". The university\nfolks tried to get me to remove it, but I pointed out that I didn't\nwork for them (I worked for IBM - it was an odd arrangement). So\nthey departed down the hall with the architect ranting. But the\nFlamingos stood.</p>\n\n<p>Bombs started going off in the University administration. Work\norders were issued. Memos to have me reprimanded got issued. But\nsomehow the admins and maintenance folks who actually run the place\nmanaged to make none of these things actually happen. It got noisy\nenough that the Pittsburgh Post Gazette did a story about it.</p>\n\n<p>A month or two later I accepted a job offer at Sun and headed\noff to California. I got off the plane, rented a car, and drove to\nthe house that I had rented from a friend. As I drove up to the\nhouse, there was quite a crowd on the sidewalks: some folks at Sun\nhad gone out and bought every plastic flamingo from every garden\nshop for miles around and stuck them on the lawn in front of the\nhouse. Newspaper article #2.</p>\n\n<p>So I start working at Sun. After a few weeks I take all the\nflamingos off my lawn and put them in a big heap in my garage. I\nkeep getting emails from folks at CMU about the flamingos. Quite a\ncottage industry had sprung up to protect them. And they started to\nspread. One of the maintenance crews who had an electric mini-truck\nto drive around campus took a flamingo and sawed it in half\nvertically from nose to tail. Then they glued the left and right\nsides of the flamingo to the doors of the truck. Made quite a sight\ndriving around.</p>\n\n<p>Getting close to Chistmas I came up with an idea for disposing\nof the heap of flamingos in my driveway: I made a Santa costume to\nfit a flamingo and built a flamingo-sized sleigh for him to ride\nin. I then placed Santa Flamingo in his sleigh pulled by\nrein-flamingos in the gardens next to Sun's building (manufacturing\nwas downstairs; engineering, sales, marketing and administration\nwere upstairs). I had enough flamingos to make a complete second\nSanta Flamingo set, which I mailed off to CMU.</p>\n\n<p>Quite by accident, my timing was excellent. Unknown to me, while\nthe box was in transit, one night a frat across the street scaled\nthe building and stole my pair of flamingos. The frat brothers\nvictory didn't last long: the Santa kit showed up almost immediatly\nand magically where once there had been two flamingos, there were\nnow 9.</p>\n\n<p>I still have some left, fading and in my garage.</p>\n\n<p>The big tragedy is that I have <b>no</b> pictures of any of\nthis. So if any old friends are reading this, I'd love to get scans\nof any photos you might have.</p>\n\n",
  "images" : [ {
    "image" : "18841E.jpg",
    "href" : null,
    "align" : "right",
    "width" : 390,
    "height" : 266
  } ]
}