{
  "date" : 1155106800000,
  "title" : "Boiling oceans",
  "body" : "For the last couple of months I've been involved with stuff at work\nthat didn't make good blog material. I've done a lot of helping out\non project reviews and kibbitzing on planning. At this point in the\nprocess, where we've got a pretty clear picture of the shape and\ndirection of things, I'm pretty happy with how it's all turned out.\nA tough process, but an important one to go through. \n\n<p>Several times I couldn't help but think of one of my favorite\nprinciples of engineering that is all-too-often forgotten:</p>\n\n<blockquote>\n  <b>A journey of a thousand miles begins with a single step.</b> \n\n  <div style=\"font-style: italic; text-align: right\">\n    <a href=\"http://en.wikipedia.org/wiki/Lao-tzu\">Lao-tzu</a>\n  </div>\n</blockquote>While this quote may be so commonplace as to be trite,\nit is too often forgotten. There is a <a href=\n\"http://www.quotationspage.com/quote/24004.html\">note about this\nquotation</a> that seems especially relevant: \n\n<blockquote>\n  Although this is the popular form of this quotation, a more\n  correct translation from the original Chinese would be \"The\n  journey of a thousand miles begins beneath one's feet.\" Rather\n  than emphasizing the first step, Lau Tzu regarded action as\n  something that arises naturally from stillness. Another potential\n  phrasing would be \"Even the longest journey must begin where you\n  stand.\" [note by Michael Moncur, September 01, 2004]\n</blockquote>At Sun we use the term \"boiling oceans\" to refer to\ntrying to do something impossibly hard all at once. It's an\nespecially silly thing to do if all you really want is a kettle of\nhot water for tea. Engineering projects too often fall into the\ntrap of over-generalizing, trying to solve problems that folks\nmight concievably have, building things so large and elaborate on\nday 1 that they never get off the ground. It is always better to\nstart with a first step. Then a second. And on... \n\n<p>One of the big sources of the problem is confusing a vision with\na to-do list. Implicit in taking the first step in a journey of a\nthousand miles is that you have to have some clue about where\nyou're going. That's the role of a vision for a project. It's\nseductive to take the vision and turn it into a to-do list. But\ngrand visions lead to insane to-do lists. The art of breaking them\ndown into manageable steps can be a tough one.</p>\n\n<p>Visions are notoriously slippery things. Your vision of a good\nplace to go, of the right target for a project, is heavily\ndependent on the time and place where you are standing and looking\nout. With every step on a journey of a thousand miles you see\nthings from a slightly different vantage point. Your vision\nadjusts. Your goal shifts. For me, that is one of the most exciting\naspects of a project: I start out with an intent, with a vision of\nwhere I hope to end up, but the true destination unfolds in\nfascinating and surprising ways.</p>\n\n",
  "images" : [ ]
}