{
  "date" : 1118991600000,
  "title" : "Finally, the end of a great week",
  "body" : "I'm finally back home connected to the net again. It's been a great\nweek. Today started with Scott McNealy's keynote, which was\nentertaining (as always). He gave out several awards for the best\nJava projects: all well deserved, and very cool. I don't remember\nthem all, but they included the JPL folks, the Brazilian Healthcare\nproject, the navigation system from Jentro, a very cool Nokia\nhandset; and a special award for Thor Norbye for his incredibly\nstudly performance during a demo on Wednesday where everything\ncrashed (it was the back end database!) and he put it back together\nin real time. Iron Chef comes to hacking.\n\n<p>The picture at the left is of me with the winners of the Urban\nAdventure contest. It was a scavenger hunt that covered a lot of\nSan Francisco. About 100 teams competed. Many were groups of\nfriends, but this team was four people who had never met before,\nbut who worked together extremely well. They turned out to have\ncomplementary skills and compatible personalities. Quite a piece of\nluck! It sounds like the whole Urban Adventure was a lot of fun for\neveryone. In general, JavaOne is end-to-end compressed learning and\nparties. Totally exhausting.</p>\n\n<p>If I had to pick one highlight of the whole week, it would be\nthat I noticed that everyone was smiling. Last year, there was a\ngeneral feeling of gloom. It wasn't about Java at all, just a\ngeneral gloom about life, the universe, and everything. This year\nwas very upbeat and charged. And unlike the bubble years, when I'd\nask folks what they were doing, the answers made sense. No fluffy\nconcepts. No goofball math. Just real products. Real business\nplans. Real success.</p>\n\n<p><i>Very</i>, <b>very</b>, cool.</p>\n\n<p>And the best part is that I get to sleep in tomorrow...</p>\n\n",
  "images" : [ {
    "image" : "Image27-small.jpeg",
    "href" : null,
    "align" : "right",
    "width" : 200,
    "height" : 150
  } ]
}