{
  "date" : 1249542000000,
  "title" : "CALL FOR PARTICIPATION: JVM LANGUAGE SUMMIT, September 2009",
  "body" : "[cross-posted from the JVM summit mailing list] This is a reminder\nfor the 2009 JVM Language Summit to be held at Sun's Santa Clara\ncampus on September 16-18, 2009. Registration is now open for\nspeaker submissions (presentations and workshops) and general\nattendance. More information is available at <a href=\n\"http://jvmlangsummit.com\">http://jvmlangsummit.com</a>. \n\n<p>The JVM Language Summit is an open technical collaboration among\nlanguage designers, compiler writers, tool builders, runtime\nengineers, and VM architects. We will share our experiences as\ncreators of programming languages for the JVM and of the JVM\nitself. We also welcome non-JVM developers on similar technologies\nto attend or speak on their runtime, VM, or language of choice.</p>\n\n<p>The format this year will be slightly different from last year.\nAttendees told us that the most successful interactions came from\nsmall discussion groups rather than prepared lectures, so we've\ndivided the schedule equally between traditional presentations\n(we're limiting most presentations to 30 minutes this year) and\n\"Workshops\". Workshops are informal, facilitated discussion groups\namong smaller, self-selected participants, and should enable\n\"deeper dives\" into the subject matter. There will also be\nimpromptu \"lightning talks\".</p>\n\n<p>We encourage speakers to submit both a presentation and a\nworkshop; we will arrange to schedule the presentation before the\nworkshop, so that the presentation can spark people's interest and\nthe workshop will allow those who are really interested to go\ndeeper into the subject area. Workshop facilitators may, but are\nnot expected to, prepare presentation materials, but they should\ncome prepared to guide a deep technical discussion. We will be\nfinalizing the program by August 19.</p>\n\n<p>The Summit is being organized by the JVM Engineering team; no\nmanagers or marketers involved! So bring your slide rules and be\nprepared for some seriously geeky discussions.</p>\n\n<p>The registration page is now open at: <a href=\n\"http://registration.jvmlangsummit.com/\">http://registration.jvmlangsummit.com/</a></p>\n\n<p>If you have any questions, send inquiries to inquire AT\njvmlangsummit.com.</p>\n\n<p>We hope to see you in September!</p>\n\n",
  "images" : [ {
    "image" : "2009JVM-summit.jpg",
    "href" : "http://jvmlangsummit.com",
    "align" : "right",
    "width" : 194,
    "height" : 256
  } ]
}