{
  "date" : 1073030400000,
  "title" : "Looking  Back, Looking Forward",
  "body" : "For the last few months I've been using a couple of pictures in\ntalks that I give. They're a pretty stark reminder of the reality\nof Moore's law.\n\n<p>This is a picture of me in about 1970. My mom insists that I was\n14, which would have been 1969, but I think it was more likely a\nyear later. This was taken at the Physics department of the\nUniversity of Calgary where I had a part-time job writing software\non a PDP-8/I for the ISIS-II satellite. In the background is the\nmachine that I wrote software for. There are a couple of 9-track\ntape drives, a couple of DECtape drives, a flatbed plotter, a\npaper-tape reader, an A/D panel, a display and immediatly to the\nright of me is the front panel for the CPU, which occupied the\nbottom half of one whole rack. The CPU was pretty hot for its day:\nabout 1/4 MHz. It had 8K of RAM that was eventually upgraded to\n12K.<br clear=\"both\">\n</p>\n\n<p>This is another picture of me. It's on my Sun employee ID card.\nIt's a java-based smart card. You can see the smart card reader\ncontacts on the bottom of the card. The CPU+memory chip is imbedded\nin the plastic next to it. Woven into the card is the antenna for\nthe RF network connection.<br clear=\"both\">\n</p>\n\n<p>Of course, the interesting thing here is not the pictures of me,\nor the demonstration of the toll the years have taken on my\nhairline. It's the technology in the background. I find it amazing\nthat the hot machine on the left, capable of doing all sorts of\ninteresting things with satellite telelemetry (including making\nhigh resolution photographs, which was a neat trick with only 8K!),\nhas less horsepower than the cheap piece of disposable plastic on\nthe right. What will it mean when todays large hot machine fits\ninto a volume smaller than a grain of rice?</p>\n\n<p>Today's hot lab machine, that would be used in places where the\nPDP-8/I was used, runs about 4GHz, which is about 2<sup>14</sup>\ntimes faster. So that's 14 doublings in 33 years, or about one\ndoubling in 28 months. These two data points give a rate for\nMoore's law that is somewhat slower than the numbers that folks\noften use (18-24 months), but it's still pretty fast.</p>\n\n<p>The exponential nature of Moore's law can really be\nnonintuitive. My favorite is a cool proof, due to Ed Fredkin, that\nP==NP. Yes! It's true! P does really equal NP. (If you don't know\nwhat I'm talking about, look <a href=\n\"http://www.ics.uci.edu/~eppstein/161/960312.html\" shape=\n\"rect\">here</a> and <a href=\n\"http://en.wikipedia.org/wiki/NP-complete\" shape=\"rect\">here</a>.)\nWell... The proof only works if you assume that you have a CPU\nwhose clock rate accelerates exponentially - it's a pretty easy\nproof since this assumption turns exponential time algorithms into\npolynomial time algorithms). Where can you buy such a crazy\nmachine? Anywhere! If you upgrade the machine on your desk every\ncouple of years, it'll be twice as fast. What you experience is a\nmachine in front of you that accelerates exponentially. Moore's law\nmakes P=NP.</p>\n\n<p>This has a number of interesting implications:</p>\n\n<ul>\n  <li>One is that folks making security standards need to be\n  careful about setting limits on key lengths: while it is true\n  that for most decent encryption/signature algorithms, the length\n  of time needed to crack the key is exponential in the length of\n  the key; it is also true that the speed of CPUs is increasing\n  exponentially, so the time until a standard with a fixed key\n  length is obsolete is <b>linear</b> in the length of the\n  key.</li>\n\n  <li>Another is that there's a different strategy for completing\n  long running calculations. Say you have some calculation that\n  will take 1000 years to complete. You could start your machine\n  running today and come back in 1000 years, but there is a better\n  way: go to the beach for 14 years (if the Moore's law doubling\n  period is 18 months), buy a new machine, and solve the problem in\n  a single year.</li>\n\n  <li>Another is that one of these days \"AI\" will really work. Read\n  <a href=\n  \"http://www.amazon.com/exec/obidos/ASIN/0262193787/ref=nosim/jamesgoslingA\"\n   shape=\"rect\"><i>HAL's Legacy: 2001's Computer as Dream and\n  Reality</i></a> for an interesting perspective on this.</li>\n</ul>\n\n<p>The computer revolution has only just begun. What will it mean\n<i>when</i> (not <i>if</i>) your wristwatch is smarter than you\nare?</p>\n\n",
  "images" : [ {
    "image" : "JamesGoslingInPhysicsLab1971ish-web.jpg",
    "href" : null,
    "align" : "right",
    "width" : 512,
    "height" : 353
  }, {
    "image" : "JamesGoslingBadge2003-web.gif",
    "href" : null,
    "align" : "right",
    "width" : 455,
    "height" : 605
  }, {
    "image" : "Generations-web.jpg",
    "href" : null,
    "align" : "right",
    "width" : 927,
    "height" : 622
  } ]
}