{
  "date" : 1287385200000,
  "title" : "Desktop Linux: The Dream Is Dead",
  "body" : "One of the saddest (but tragically true) technology articles I've\nread lately is Robert Strohmeyer's article in PCWorld <a href=\n\"http://www.pcworld.com/businesscenter/article/207999/desktop_linux_the_dream_is_dead.html?tk=hp_new\">Desktop\nLinux: The Dream Is Dead</a>. The most important paragraph is: \n\n<blockquote>\n  Ultimately, Linux is doomed on the desktop because of a critical\n  lack of content. And that lack of content owes its existence to\n  two key factors: the fragmentation of the Linux platform, and the\n  fierce ideology of the open-source community at large.\n</blockquote>One of the key pieces of the linux ideology that has\nbeen a huge part of the problem is the focus on \"free\". In extreme\ncorners of the community, software developers are supposed to be\nfeeding themselves by doing day jobs, and writing software at\nnight. Often, employers sponsor open-source work, but it's not\nenough and sometimes has a conflict-of-interest. In the enterprise\nworld, there is an economic model: service and support. On the\ndesktop side, there is no similar economic model: desktop software\nis a labor of love. \n\n<p>The enterprise model for linux has been a huge success. Folks\nfrom the proprietary software world find this perplexing. One of\nthe better ways of looking at it is that proprietary software\ntypically has a large sales force, does expensive advertising, and\nso has a generally large cost-of-sales. Often, the cost-of-sales is\nalarmingly close to the license fee - they cancel out. So why not\njust give the software for free and let it sell itself? Volume goes\nup, so service and support revenue will go up too. All goodness. My\nmajor problem with this revenue model is that it creates a\ndis-incentive for quality: crappy software needs more service and\nsupport. This is counterbalanced by the fact that crappy software\nis also less likely to get adopted, but the tension is there. I've\nactually heard senior executives push back on projects to improve\ninstallation and configuration because that removes service and\nsupport opportunities - \"features\" and demos are good because they\nhelp sales. This isn't just an open-source phenomenon: I've heard\nit very strongly from large proprietary software companies.</p>\n\n<p>But for desktop software, the service-and-support model doesn't\nwork. To be successful, desktop software has to \"just work\". Some\nfolks do shareware or donateware, but it's not very successful:\nsuch models rarely generate enough money to keep the developers\nfed. And the packaging model of most of the distributions\ndiscourages economic models: they slurp up the source and compile\nit themselves, holding on to the relationship with the user. Money\nisn't evil: it's just a way of keeping score in a barter economy.\nI'm happy to trade code for food. And it doesn't take much money to\nmake things work: look at the iPhone app store. If the Gimp cost a\nfew dollars, the development team could put a lot more energy into\nthe Gimp and it would be hugely better for it. Now it's just a\nshadow of Photoshop (sorry), which succeeds despite rapacious\npricing.</p>\n\n<p>Developers follow the money. They aren't evil, they just need to\nbe fed and housed. Unless the Linux community gets over the whole\n\"free\" thing on the desktop, Strohmeyer's pronouncement of death\nwill hold.</p>\n\n",
  "images" : [ {
    "image" : "207999-sad-penguin_180.jpg",
    "href" : "http://www.pcworld.com/businesscenter/article/207999/desktop_linux_the_dream_is_dead.html?tk=hp_new",
    "align" : "right",
    "width" : 180,
    "height" : 280
  } ]
}