{
  "date" : 1273388400000,
  "title" : "I want to like the iPad",
  "body" : "<div class=\"floatImage\">\n  Neither Fish nor Fowl\n</div>Really, I do. I put in my order for a 3G iPad on day 1 and\ncalmly waited my turn for the Blessed Object to arrive. It has that\n`I must have it' sensuality that Apple has become so good at. But a\nweek later, I don't get it. It's magical, but the magic feels more\n<a href=\"resource/oz-curtains1.jpg\" rel=\"lightbox\" title=\n\"Pay no attention to the man behind the curtain!\">Oz</a> than <a\nhref=\"resource/dumbledore_1.jpg\" rel=\"lightbox\" title=\n\"*this* is a wand!\">Dumbledore</a>. It feels more like a business\nmodel looking for a device to express it, rather than something\nthat actually fills a need. I like a lot of Apple products, but\nthis one is a clear victory of style over substance. \n\n<p>I've been trying to figure out what it's good for, where it\nshines. Lounging around on the couch browsing the web is pretty\nwonderful. But if I want to take it with me, it falls apart: it\ndoesn't just follow me, the way my iPhone does, which is attached\nto me. I have to actually put it in my hand. It's exactly as easy\nand as hard to bring with me as a laptop - it takes up a hand or a\nslot in my backpack. It's a little lighter. But not by enough to\nmake a difference. And yet it's a whole lot less useful than a\nlaptop. It's difficult to do much typing with: the onscreen\nkeyboard is clumsy, and when I try to use it for long, my fingers\nend up hurting because the hard glass doesn't smoothly cushion my\nfingers the way a good keyboard does. I bought a bluetooth keyboard\nto use with it, which works well, but then I'm lugging two objects\ninstead of one, and without a mouse I'm constantly having to lift\nmy hand off the keyboard to touch the screen, which then makes it\nfall over :-(</p>\n\n<p>I know I'm deeply <i>not</i> the target market, so my\ndisillusionment probably doesn't matter. But I've watched my\ntwelve-year-old daughter play with it. She likes it for playing\ngames, but oddly enough, she seems to prefer my iPhone because it's\na more comfortable size, and it's easier to take along. She browses\nthe web with it, but as soon as she starts typing complicated URLs\nor Google queries, she heads over to the laptop.</p>\n\n<p>And then there's the control-freak's-fantasy-developer-model.\nYikes.... <a href=\n\"http://www.eff.org/deeplinks/2010/03/iphone-developer-program-license-agreement-all\">Enough\nhas been written by others about that nightmare.</a></p>\n\n<p>My fantasy Apple product is simple: stop treating OS X like\nabandon-ware.</p>\n\n",
  "images" : [ {
    "image" : "ThingEatsPerson.jpg",
    "href" : null,
    "align" : null,
    "width" : 851,
    "height" : 765
  } ]
}