{
  "date" : 1068969600000,
  "title" : "T-Shirt Hurling Contest",
  "body" : "Yes, it's on. We havn't quite figured out the rules of the contest\nor the process by which it is run. But interested folks should\nstart thinking about wierd and interesting ways to get t-shirts\ndelivered to an audience. In the past I've just used my arm, used\nvarious slingshots, a compressed air cannon, and built a medieval\nsiege weapon (a trebuchet). But I <b>know</b> that there are many\npeople who could come up with much more creative solutions. There's\nreally only one rule: \n\n<div style=\n\"font-style: italic; font-weight: bold; text-align: center\">\n  Don't Freak Out the Fire Marshal\n</div>\n\n<p>This is a pretty broad rule. There are many corollaries that\nshould be pretty obvious. Things like \"No maiming the audience\".\nAlso, by the nature of the contest, t-shirts have to be delivered\nsomehow to the audience within the confines of the conference\nhall.</p>\n\n<p>The current proposal for how to run the contest is to do it in\ntwo phases: first: entrants submit proposals that get judged by a\npanel. second: the top three actually build/perform/whatever their\nproposal in front of the JavaOne crowd and the winner gets chosen\nthen. This would allow people from all over the world to enter.\nIt's not clear what the prize would be, but I'm trying to arrange\nfor there to be a financial component: the three finalists would\nreceive the money for the third prize award a couple of months\nbefore JavaOne (it's clear at that point that each of them will win\nat least that much). Then at JavaOne the first and second prize\nwinners get their awards. That way, there's some cash to help\nentrants defray the cost of constructing their entries. But it's\nnot clear that this is possible: it turns out that when there are\ncash awards involved, there are special legal requirements on\ncontests. We're still trying to figure it out.</p>\n\n<p>So get creative! Explore your inner geek! Or your inner artist!\nLeft brain! Right brain! All kinds of stuff could be cool.... Rail\nGuns? (they'll need one hell of a safety plan) Taiko Drums? Blimps?\nDancing troups? The possibilities are endless. <i>Get Cool</i></p>\n\n",
  "images" : [ {
    "image" : "Image46-large.jpeg",
    "href" : null,
    "align" : "right",
    "width" : 422,
    "height" : 530
  } ]
}