{
  "date" : 1147676400000,
  "title" : "JavaOne, day 0",
  "body" : "Day 0 of JavaOne has been a long one... \n\n<ul>\n  <li>I had a bit of a panic over the server for the <a href=\n  \"http://race.java.sun.com\">Slot Car Programming Challenge</a>. I\n  had to make a bunch of networking code more robust - it wasn't\n  dealing with flakey networks real well. Hacked well into the\n  early morning. But the race is now live and open. If you've\n  downloaded the tools and prototype code, you can now register.\n  The registration tool is live (it has been since early this\n  morning). The prototype code is actually a complete app to race a\n  car: it works, but it isn't real fast. There are all kinds of\n  interesting tricks you can play with, like getting tricky with\n  timing and braking.</li>\n\n  <li>I did an opening talk at what's called \"Licensee Day\", where\n  all the folks that build Java platforms get together - companies\n  like Motorola, Nokia and IBM.</li>\n\n  <li>We had a pre-JavaOne conference dedicated to NetBeans\n  (\"NetBeans Day\"). Major trouble with the Fire Marshall because\n  too many people showed up. A good problem to have.</li>\n\n  <li><a href=\"http://netbeans.org\">NetBeans 5.5 &#946;</a> got\n  released today. Very nice... Great enterprise tools.</li>\n\n  <li>The show gizmo is a cell phone from <a href=\n  \"http://www.savaje.com/\">SavaJe</a>. The especially cool thing\n  about it is that it's the first phone that implements <a href=\n  \"http://www.jcp.org/en/jsr/detail?id=209\">JSR 209</a>: pretty\n  much all of Swing and 2D graphics that anyone cares about. Nice\n  graphics rendering performance. With nice tools support: between\n  the mobility pack for CDC and Matisse, life is easy.</li>\n\n  <li>The day ended with the alumni fireside chat. We had about a\n  half dozen of us from the Java organization at Sun doing a couple\n  of hours of open mic Q&amp;A.n It's only half about answering\n  questions: the other half is that we get interesting feedback on\n  what's important to the community.</li>\n\n  <li>There was piles of other stuff going on that I never got to.\n  And JavaOne doesn't start until tomorrow...</li>\n</ul>\n",
  "images" : [ ]
}