{
  "date" : 1081753200000,
  "title" : "The Sun/Microsoft settlement",
  "body" : "Since the announcement of Sun's settlement with Microsoft over\nJava, there has been a lot of rampant speculation echoing back and\nforth over the net. A lot of it reads like bad conspiracy-theory\nstuff. People have been reading between the lines and making stuff\nup. This echos around the rumor mill and gains the appearance of\nfact. I'd like to try to set the record straight on a number of\npoints: \n\n<ul>\n  <li>\n    In Rick Ross's <a href=\n    \"http://www.javalobby.org/nl/archive/jlnews_20040406o.html\"\n    shape=\"rect\">Where Is Java In This Settlement?</a> he worries\n    that Sun may have sold out the Java community. We didn't. We\n    have not sold our soul to the Dark Side. We haven't overnight\n    turned into mindless lap dogs. We've had a lot of experience\n    with Microsoft over the years, and it has made us very\n    cautious.\n\n    <p>One of his big concerns was about the departure of Rich\n    Green, which the rumour mills say left Sun in disgust (as\n    reported in The Register). This is unbelievably far from the\n    truth. Rich Green was my boss, I was with him day after day.\n    Rich worked very hard to make this agreement happen. He left in\n    relief, happy that things were settled in a way that left him\n    with a clear conscience and a sense of closure. In fact he (and\n    I, and many others) felt that concluding the suit was good for\n    Sun, good for the industry, and good for the Java community. He\n    left for entirely independent reasons that have nothing to do\n    with Sun and had really been hanging in to make sure that the\n    court cases got settled right. He still has good relationships\n    with everyone at Sun and left on a very friendly basis. He will\n    be missed by all of us, and will remain a visible presence in\n    the industry.</p>\n\n    <p>Farther down in the article Rick characterizes Microsoft as\n    having paid off Apple to \"abandon its commitment to Java\n    compatibility\". I use Apple's OS X every day, and I work with\n    folks at Apple all the time: their commitment to Java\n    compatibility is very real.</p>\n\n    <p>One thing he says that I agree with is where he says \"How\n    can Sun show us that it still has the strength, vision and\n    leadership to deserve our support and loyalty? The way they\n    should do it, in my opinion, is by ensuring that a significant\n    portion of the settlement proceeds will be used to benefit Java\n    developers and strengthen independent, standards-based efforts\n    to advance Java.\". This is exactly what's being done. Our\n    investment in and commitment to Java is very strong.</p>\n\n    <p>We fought hard to win those court cases. And we did win.\n    Bigtime. Finally getting them cleared up gives us an extra pile\n    of cash to invest in moving forward, it stops sucking the life\n    out of all of us who dedicated enormous amounts of time to the\n    cause, and it frees us from all sorts of procedural\n    entanglements that were a part of the litigation process. This\n    settlement is a <i>Very Good Thing</i>.</p>\n  </li>\n\n  <li>\n    There's a long thread of discussion on Slashdot <a href=\n    \"http://slashdot.org/article.pl?sid=04/04/12/1245208&amp;mode=flat&amp;tid=102&amp;tid=108&amp;tid=123&amp;tid=126&amp;tid=156&amp;tid=187&amp;tid=99\"\n     shape=\"rect\">Two Takes on the Java Dilemma</a> that is pretty\n    entertaining, from a <i>wow, what are they smoking!</i> point\n    of view. There are voices of reason, and conspiracy nuts. There\n    are so many comments that it's impossible to go through them\n    all. I'll just address a couple near the top: Java is most\n    definitely <b>not</b> for sale. Not to IBM, not to anyone. \n\n    <p>There are a set of postings in that thread that aren't\n    directly about Java, they're about Unix and x86:</p>\n\n    <blockquote>\n      <i>Yes, Intel x86 can handle many of the tasks that only Unix\n      machines used to be able to handle. I'd just tend to debate\n      whether they're capable of doing these tasks as cost\n      effectively, as reliably, and as efficiently.</i> \n\n      <p>Well judging by the amount of people dropping their old\n      UNIX gear, and taking up rackfulls of AMD or Intel boxes\n      (especially the new 64bit offerings), i'd say the answer to\n      that is a big YES.</p>\n    </blockquote>This is a bizarre comparison because x86 is a CPU\n    architecture, and Unix is an operating system family: they are\n    not the same things! All the Unix flavors run perfectly well on\n    x86. Yes: Linux is a Unix flavor. Where this relates to Java\n    and Sun is that because such a huge fraction of customer\n    applications that run on Sun hardware is written in Java, we\n    can treat CPUs (and even operating systems) as commodities, in\n    the same way we treat disk drives. We can use whatever\n    underlying CPU technology (x86/x86-64/Sparc/...) or OS\n    technology (Solaris/Linux/...) is most suitable for the\n    situation at hand. We aren't constrained by the instruction set\n    or OS interface that is baked into our customers' applications.\n    This is <i>hugely</i> liberating for hardware design.\n  </li>\n\n  <li>\n    As for Richard Stallman's <a href=\n    \"http://www.newsforge.com/article.pl?sid=04/04/07/2021242\"\n    shape=\"rect\">Free but shackled: The Java trap</a> , it's hard\n    to know where to begin. He has his own rather peculiar\n    definition of \"Free\" that I think violates the First Law of\n    Thermodynamics (energy is conserved): developers put a huge\n    amount of energy into creating software and if they can't get\n    that energy back in a way that balances, then the system falls\n    apart. I've been in this discussion countless times and I'd\n    like to avoid landing there again. GPL software is not \"free\":\n    it comes with a license that has a strong political agenda.\n    Like GPL software, the Java platform is \"free\" in many senses:\n    you don't have to pay anything for the runtime or developers\n    kit and you can get the sources for everything. Unlike GPLd\n    software, the Java sources don't come with a viral infection\n    clause that requires you to apply the GPL to your own code. But\n    the sources for the JDK do come with a license that has a\n    different catch: redistribution requires compatibility testing.\n    \n\n    <p>This is just context for the real point I want to make: when\n    you have platform software like Linux or the JDK, the platform\n    interface (in the case of Java, the VM and API specifications)\n    divides the world of developers into two groups: those who work\n    under the interface to implement it, and those who work above\n    the interface and build applications based on it. These two\n    communities have needs that conflict. In particular, a blanket\n    freedom for developers under the interface, to do whatever they\n    damn well please, is incredibly disruptive and damaging to\n    developers above the interface. The catch in the Sun Java\n    source license is all about defending the needs of developers\n    who work above the interface. This ends up being constraining\n    to folks who work under the interface, but in a way that is\n    hugely beneficial to those who work above. We believe that for\n    a developer who has built a Java application they have a right\n    to trust that when some other developer says \"I have a Java VM\n    for you to use\", that their application will work.</p>\n\n    <p>So yes, like the GPL, our source license does have an\n    agenda. It's not a hidden one, and we believe it's a very\n    beneficial one (at least, to application developers!).</p>\n  </li>\n\n  <li>There has been a big debate about implementation languages in\n  the Gnome world. It's been all over the map, but one point of\n  concern has been a set of formless dreads about the usability of\n  the Java language specification. We've been very clear about\n  this, but it seems like few have read the spec: if you look in\n  the frontmatter, it contains an explicit statement that anyone is\n  free to implement the specification. It goes much farther than\n  most other specification documents: it actually includes a patent\n  rights grant.</li>\n</ul>We're not a bunch of moronic secret subversive Microsoft\nlapdogs. We've worked very hard over the years to fairly balance\nthe needs of all the various communities. Relax. Have a little\nfaith.\n",
  "images" : [ ]
}