{
  "date" : 1256799600000,
  "title" : "The Network Is",
  "body" : "<i>Yet Another Happy Birthday Inter<a href=\n\"http://en.wikipedia.org/wiki/Series_of_tubes\">tubes</a>!!</i>\nToday marks 40 years of the internet, although there's some debate\nas to the actual date. I consider myself a latecomer: I didn't get\nmy first real internet email address until 1977, C410JG40@CMUA. I\nwas \"jag\" on various Unix systems before then, but it wasn't until\n1977 that the ARPAnet and email really took over my life. I soon\nrealized that the only real-world friendships I kept up with were\nfolks that I could send email to. I disappeared from my brother and\nsister's lives until they got email addresses 20 years later. Of\ncourse now it's gotten to the point where restaurants don't exist\nunless they're on <a href=\"http://opentable.com\">OpenTable</a> :-)\nI wrote the original Unix Emacs in 1978 and because of that by\nsometime in 1980 I had the unusual distinction of having login IDs\non every non-military host on the ARPAnet (I kept track - it had\nbecome sport). \n\n<p>When I joined Sun in 1984 (yikes! Has it been that long?) one of\nthe big attractions was Sun's position on networking: every machine\nhad a network connection. At the time, that was considered pretty\nweird. I had known Bill and Andy for years. They had both tried to\nget me to join Sun at the beginning in 82, but I foolishly didn't.\n\"The Network is the Computer\" was a pretty odd tagline at the time,\nand it didn't make sense to most people, but it had geeky appeal. A\nlot could be done when you tied machines together: from harnessing\nthe compute power of clusters of machines, accessing filesystems\nremotely via NFS, remote graphics access, and a whole lot more.</p>\n\n<p>But the network had more than mere geek appeal for me. It felt\n<i>important</i> in a world-changing kind of way. This crystalized\nwhen I read <a href=\n\"http://en.wikipedia.org/wiki/Robert_Axelrod\">Robert Axelrod</a>'s\n1984 book <a href=\n\"http://www.amazon.com/exec/obidos/tg/detail/-/0465021212/ref=ase_jamesgoslingA/\"><i>The\nEvolution of Cooperation</i></a>. This is a reasonably accessible\ngame theory book that discusses experiments involving <a href=\n\"http://en.wikipedia.org/wiki/Prisoner%27s_Dilemma\">the Prisoners\nDilemma</a>. I won't repeat what you can find by reading the <a\nhref=\n\"http://en.wikipedia.org/wiki/The_Evolution_of_Cooperation\">Wikipedia\narticle</a> (which I urge you to do; read the book too). But by the\nend of the book, there is a strong conclusion that <i>as the\nfrequency of interaction increases, the optimal strategy shifts\nfrom hostility to cooperation</i>. This really appealed to my 60's\npeacenik leanings because it suggested that all you needed to do\nwas to get people communicating, and inevitably peace would break\nout. It doesn't matter much the form the communication takes, all\nis good.</p>\n\n<p>At that point in my life, the network went from a geeky toy to a\nmoral good. I don't know how to express how thrilled I am at how it\nhas all played out. From the effects of the network in keeping the\n<a href=\n\"http://www.ibiblio.org/pub/academic/communications/logs/report-ussr-gorbatchev\">news</a>\nflowing during the <a href=\n\"http://en.wikipedia.org/wiki/1991_Soviet_coup_d'%E9tat_attempt\">1991\nSoviet coup d'&#233;tat attempt</a>, to FaceBook, Twitter, Blogging\nand all of todays social media.</p>\n\n<p>These days I think that Sun should shorten its tagline from \"The\nNetwork is the Computer\" to simply \"The Network\n<i><b>Is</b></i>\".</p>\n\n<p>My biggest disappointment with the internet is that it seems\nthat the \"killer app\" that makes the economics of the Internet work\nis advertising...</p>\n\n",
  "images" : [ {
    "image" : "internet750.png",
    "href" : "http://discovermagazine.com/2006/oct/map-internet-servers",
    "align" : "right",
    "width" : 186,
    "height" : 170
  } ]
}