{
  "date" : 1147244400000,
  "title" : "Out of Africa; into the Fire",
  "body" : "I got back from Johannesburg last Saturday. We did three days of\ntechnical education sessions at the Tech Days event. There are lots\nof good engineers in South Africa, and no shortage of work for them\nto do. I was last there about 8 years ago. The contrast is\ndramatic. People feel safe. The economy is booming. Buildings are\ngoing up everywhere. House prices are getting painfully high. The\nairport is swamped. All in all, a very cool place these days. I got\na few hours to visit <a href=\n\"http://en.wikipedia.org/wiki/Pilanesberg_National_Park\">Pilanesberg\nNational Park</a>. I got lots of great pictures of the wildlife,\nbut one got a little close: an elephant decided to walk up to our\njeep and just after I took this picture, he decided to charge. The\ndriver jammed his foot on the accelerator and we got away with just\na scrape from a tusk. The drivers guess is that the elephant was\ndrunk: apparently there's a fruit that grows in the park which the\nelephants like. This time of year the ones left on the trees are\nover-ripe and fermented. \n\n<p>I got back on Monday to the firestorm-that-is-JavaOne. Things\nwere pretty crazy a couple of weeks ago, but pretty much lined up\nand calm(er) now. The hard part is that there's just too much cool\nstuff going on. I'm doing the \"toy show\" keynote at the end of the\nconference again (Friday morning). I've got six long (7 minute)\ndemos to run through. Each needs an hour or two to get the full\npicture. There was a lot of anguish in cutting the cool-stuff list\ndown to just six demos. The decision process has never been\ntougher. The tuesday keynote is also heavily loaded with demos. I'm\nexcited.</p>\n\n<p>I foolishly volunteered to do a bunch of the IT for the slot car\nrace. It's mostly pretty solid, but there are definitely rough\nedges. Some probably won't get fixed because we're nervous about\ndestabilizing the whole thing. But I can't resist tinkering...</p>\n\n",
  "images" : [ {
    "image" : "CloseElephant.jpg",
    "href" : null,
    "align" : "right",
    "width" : 1024,
    "height" : 682
  } ]
}