{
  "date" : 1248850800000,
  "title" : "Fun with Duke",
  "body" : "It's been a really weird summer, mostly in a good way. Easily the\nweirdest summer of my professional career. A lot of stuff has been\ngoing on, much of which would make good blog material, but none of\nit can be blogged about. The Oracle transition can't happen fast\nenough. \n\n<p>I have spent some time on a silly but fun project: moving the\nDuke artwork from duke.dev.java.net to <a href=\n\"http://kenai.com/projects/duke\">kenai.com/projects/duke</a>. Along\nthe way I added a bunch of new artwork collected from assorted\nplaces. Duke's new home uses a <a href=\n\"http://kenai.com/projects/help/pages/TempWebsiteFeature\">new kenai\nfeature</a> that's in early alpha testing: the ability to associate\na WebDAV filesystem with a project. In this case, it's <a href=\n\"http://duke.kenai.com\">http://duke.kenai.com</a>, or via webdav at\nhttps://kenai.com/website/duke</p>\n\n<p>Among the new artwork is the <a href=\n\"http://duke.kenai.com/J1-2009-HugeBanner/index.html\">giant\nbillboard/banner</a> that appeared at Moscone for the last JavaOne.\nThe \"gigantic\" image is 28000x6400: don't bother downloading it\nunless you have a really big printer.</p>\n\n<p>Another interesting one is the <a href=\n\"http://duke.kenai.com/Sun-EndOfAnEra-TShirt/index.html\">artwork\nfor a tshirt that was never produced</a> that was intended for an\n<i>End of an Era</i> party for Sun employees at Great America. The\nparty never happened. The artwork is kinda fun: it features Duke\nhaving a beer with a character based on a Sun100 workstation -\nsun's first computer. If you look at the high resolution version,\nyou'll see that the Sun100 is running OpenSolaris :-) If you want a\nshirt or mug made with it, I put it up on <a href=\n\"http://www.cafepress.com/sunsWildRide\">cafepress</a>.</p>\n\n",
  "images" : [ {
    "image" : "SunWakeTShirt.png.png",
    "href" : "http://www.cafepress.com/sunsWildRide",
    "align" : "right",
    "width" : 128,
    "height" : 95
  } ]
}