{
  "date" : 1316242800000,
  "title" : "Some more detail",
  "body" : "It's been a pretty shaky day. Last night, those of us who have been\nrenting the box together for years got together for dinner. Those\nof you from Sun might remember Rob Gingell, BIll Meine and Jim\nMitchell. Jean Elliott was at dinner, and was supposed to be with\nus in the box seat, but she couldn't be there on Friday. We spent a\nlot of time talking about the experience. Normally, when one of\nthese planes has a problem, it's something to do with the engine.\nThe pilot retains some level of control and is able to fly (glide?)\nit to a generally safe landing. One such incident occurred on\nThursday where the pilot had to belly-land in the desert. But this\ncrash was different: it was clearly a control system problem. The\nengine seemed to be running full throttle until the very end. The\nplane pitched up and it appeared that the pilot was trying to climb\nup out of the race zone - the planes typically race pretty close to\nthe ground. 100feet-ish. \n\n<p>But after climbing for a few seconds the plane jerked again and\nrolled into an almost vertical nose down descent. I (and everyone\nelse in the box) were looking directly at the plane through this\nwhole thing. We watched it come straight down. We all have this\nimage of the plane coming directly at us. We saw the prop spinning\nfull speed, and nothing else but the wings. No fuselage or tail\npoking out the sides. Straight into us. But then it jerked in it's\ndescent - during dinner we talked about this a lot and we all\nremember the jerk - and it turned slightly to the east. When it\nimpacted it was still almost vertical, but since we were on the\nacute side of the impact angle, most of the debris went away from\nus. We were really <i>really</i> close to the impact, but not a\nscratch. A lot of people were not so lucky. My heart goes out to\nthem. It was horrific.</p>\n\n<p>This whole crash was a matter of just a couple of seconds.\nRunning wasn't physically possible. Race speed for the plane is\nabout 500mph. One second = 733 feet. If it impacted at that speed,\nfrom the time that the nose first touched the runway, until the\nlast piece of the tail impacted would have been about 43\nmilliseconds (the plane was 32 feet long). People who have seen\npictures have asked \"where is the wreckage?\", but at those speeds,\nalmost the only largish chunk was the engine block. The rest was at\nmost an inch or two in size. Dust.</p>\n\n<p>I didn't take any pictures of the descent, but I took several of\nthe crash site. I'll spare you most of them, but I've put one here.\nTwo things to notice: see that horizontal section of blue carpet?\nOur box was 10 feet this side of it. I was standing in the aisle\nbehind the box when the impact happened. I took the picture from\nwhere I was standing when the impact happened. The dust settled\nextremely quickly. The second thing to notice is the hole. That's\nthe impact crater. And it wasn't your average city asphalt road:\nthe boxes were on a taxiway/parking apron of a dual\nmilitary/civilian airport. A tough surface.</p>\n\n<p>The impact happened in the middle of the aisle between the first\nand second rows of box seats, which saved a lot of lives. The\ndebris field stretches far out on the other side of the impact\npoint, angled slightly away from the bleachers - row one was almost\ntotally obliterated. Row two wasn't a happy place either. There are\nmore pictures at the <a href=\n\"http://www.rgj.com/article/20110916/EVENTS05/110916036/Complete-first-day-coverage-Reno-air-race-crash-killed-least-3-injured-more-than-55\">Reno\nGazette Journal</a>.</p>\n\n",
  "images" : [ {
    "image" : "CrashPath.png",
    "href" : null,
    "align" : "right",
    "width" : 104,
    "height" : 200
  }, {
    "image" : "Reno2011CrashMedium.jpg",
    "href" : null,
    "align" : null,
    "width" : 1024,
    "height" : 683
  } ]
}