{
  "date" : 1083308400000,
  "title" : "Open sourcing Java",
  "body" : "There's been a lot of churn lately over open letters from IBM and\nothers calling for Sun to open source Java. Rather than try to\nrespond to everyone individually, I'll try to respond to a pile of\nquestions here: \n\n<ul>\n  <li>Some have asked why IBM is sending open letters, rather than\n  talking to us directly: asking if this isn't rather\n  kindergarten-ish. Well, yes: it does appear that way.</li>\n\n  <li>Some have asked what IBM would get if Java were open-sourced:\n  doesn't IBM already have the source? Again yes, they do have the\n  source. It's also true that anyone can get the source. The major\n  restriction is that if folks want to redistrubute their changes,\n  they have to pass the test suite. Which means that about the only\n  thing that they could get from liberalization is to be able to\n  skip testing.</li>\n\n  <li>Some of IBM's statements have essentially distilled down to\n  \"we'd love to help: open source java so that we can\". This has\n  led to questions about whether or not IBM has been able to help.\n  The answer is that they have. They're one of the strongest\n  participants in the Java Community Process. Their participation\n  over the years has been substantial, and we're very thankful for\n  it. For example, IBM was the major mover that led to the creation\n  of the Swing API to replace the AWT api. They contributed many\n  engineers to the Swing team. Viewing that time in hindsight, it\n  is more than slightly ironic that these days they're endorsing\n  SWT, which is essentially a clone of the AWT architecture, which\n  they had strongly condemmed back when the decision to create\n  Swing was being debated.</li>\n\n  <li>Some have asked when, given IBM's apparent zeal for open\n  source, DB2 and WebSpere will be open sourced: ask them, not me -\n  it does seem unlikely.</li>\n\n  <li>\n    Most of the comments I've heard from folks about open sourciing\n    Java have been negative. Hmmm... Not so much negative as\n    concerned: Developers value Java's cross platform\n    interoperability and reliability. They're afraid that if Java\n    is open-sourced then someone will try to fragment the community\n    by creating incompatible versions of Java and ignore the\n    community process, just like Microsoft did. Microsoft did a lot\n    of damage to the community and many developers strongly do not\n    want that to happen again. \n\n    <p>This is a big issue for us. <i>If</i> we do something to\n    make Java even more open-source than it is already, having\n    safeguards to protect the developer community will be something\n    we pay a lot of attention to. Carefully done, open-sourcing\n    could actually promote interoperability by making it easier for\n    disparate groups to align behind one code base.</p>\n  </li>\n</ul>\n",
  "images" : [ ]
}