{
  "date" : 1128409200000,
  "title" : "Only solve the problems you need to solve",
  "body" : "Back when I was a grad student I was spinning out of control trying\nto come up with a thesis topic. My <a href=\n\"http://www.computerhistory.org/events/index.php?spkid=2&amp;ssid=1090276799\"\n shape=\"rect\">advisor</a> took me out to lunch one day and asked me\na simple question: \"What is a PhD thesis?\" I yattered on for a\nwhile and he listened patiently. Eventually he said \"No: It's just\na stack of 100 pages with 4 signatures on top\". I was falling into\na common grad student trap of feeling that I needed to do something\ngrandiose and solve all of the worlds problems. He was into \"keep\nit simple\". So I did, and I came up with a pretty straightforward\nthesis proposal. The odd thing was that when I finally finished my\nthesis, I realized that I had only delt with one sentence out of\nthe simplified proposal. \n\n<p style=\"text-align: left\">I got a lot of email about my previous\npost, a lot of it centered on JINI, RMI and CORBA. Not too many\nmonths ago, during the hypon flux storm [by analogy with <a href=\n\"http://catb.org/~esr/jargon/html/B/bogon-flux.html\" shape=\n\"rect\">bogon flux</a>] surrounding SOA and Web Services it was\nworth one's life to mention that folks had been successfully\nimplementing SOAs for years. That has calmed down significantly. <a\nhref=\"http://www.jini.org/\" shape=\"rect\">JINI</a> is particularly\ninteresting since it goes significantly beyond what's possible with\ntoday's SOA - but it only works in a Java-only universe. The folks\nwho developed RMI/JINI had previously worked on CORBA. A big chunk\nof the complexity of CORBA comes from trying to solve the\ncross-language problem. They discovered that if you don't try to\nsolve that problem, some very cool things emerge. The poster child\nfor building SOAs on JINI is <a href=\n\"http://www.jini.org/solutions/Jini_Orbitz_Profile_Final.pdf\"\nshape=\"rect\">Orbitz</a>. There are some interesting discussions <a\nhref=\n\"http://www.jroller.com/page/csterwa?entry=jim_waldo_s_talk_on\"\nshape=\"rect\">here</a> and <a href=\n\"http://www.jini.org/events/0505NYSIG/index.htm\" shape=\n\"rect\">here</a>.</p>\n\n<p style=\"text-align: left\">In response to the comment about OO and\ngranularity: they really are orthogonal axes. OO methodologies work\nwell regardless of granularity. But granularity is related to the\nquestion of whether or not an operation can sensibly involve a\nnetwork transit: it only works well when granularity is high. This\nis a direct corollary of the <a href=\n\"http://today.java.net/jag/Fallacies.html\" shape=\"rect\">Eight\nFallicies of Distributed Computing</a>.</p>\n\n",
  "images" : [ {
    "image" : "2005_10_04_20-54-21-852_n3.small.png",
    "href" : null,
    "align" : "right",
    "width" : 117,
    "height" : 150
  } ]
}